{
    "owid-energy-data.csv": {
        "name": "owid-energy-data.csv",
        "description": "The dataset is named 'owid-energy-data.csv' and it appears to be about energy data from different countries and years. \n\nThe dataset contains the following attributes (columns):\n1. row_id - unique identifier for each row\n2. country - name of the country\n3. year - year of data collection\n4. iso_code - ISO code of the country\n5. population - population of the country\n6. gdp - gross domestic product of the country\n7. biofuel_cons_change_pct - percentage change in biofuel consumption\n8. biofuel_cons_change_twh - change in biofuel consumption in terawatt-hours\n9. biofuel_cons_per_capita - biofuel consumption per capita\n10. biofuel_consumption - total biofuel consumption\n11. biofuel_elec_per_capita - biofuel electricity consumption per capita\n12. biofuel_electricity - total biofuel electricity consumption\n13. biofuel_share_elec - share of biofuel in electricity generation\n14. biofuel_share_energy - share of biofuel in total energy consumption\n15. carbon_intensity_elec - carbon intensity of electricity generation\n16. coal_cons_change_pct - percentage change in coal consumption\n17. coal_cons_change_twh - change in coal consumption in terawatt-hours\n18. coal_cons_per_capita - coal consumption per capita\n19. coal_consumption - total coal consumption\n20. coal_elec_per_capita - coal electricity consumption per capita\n21. coal_electricity - total coal electricity consumption\n22. coal_prod_change_pct - percentage change in coal production\n23. coal_prod_change_twh - change in coal production in terawatt-hours\n24. coal_prod_per_capita - coal production per capita\n25. coal_production - total coal production\n26. coal_share_elec - share of coal in electricity generation\n27. coal_share_energy - share of coal in total energy consumption\n28. electricity_demand - electricity demand\n29. electricity_generation - total electricity generation\n30. electricity_share_energy - share of electricity in total energy consumption\n31. energy_cons_change_pct - percentage change in energy consumption\n32. energy_cons_change_twh - change in energy consumption in terawatt-hours\n33. energy_per_capita - energy consumption per capita\n34. energy_per_gdp - energy consumption per unit of GDP\n35. fossil_cons_change_pct - percentage change in fossil fuel consumption\n36. fossil_cons_change_twh - change in fossil fuel consumption in terawatt-hours\n37. fossil_elec_per_capita - fossil fuel electricity consumption per capita\n38. fossil_electricity - total fossil fuel electricity consumption\n39. fossil_energy_per_capita - fossil fuel energy consumption per capita\n40. fossil_fuel_consumption - total fossil fuel consumption\n41. fossil_share_elec - share of fossil fuels in electricity generation\n42. fossil_share_energy - share of fossil fuels in total energy consumption\n43. gas_cons_change_pct - percentage change in gas consumption\n44. gas_cons_change_twh - change in gas consumption in terawatt-hours\n45. gas_consumption - total gas consumption\n46. gas_elec_per_capita - gas electricity consumption per capita\n47. gas_electricity - total gas electricity consumption\n48. gas_energy_per_capita - gas energy consumption per capita\n49. gas_prod_change_pct - percentage change in gas production\n50. gas_prod_change_twh - change in gas production in terawatt-hours\n51. gas_prod_per_capita - gas production per capita\n52. gas_production - total gas production\n53. gas_share_elec - share of gas in electricity generation\n54. gas_share_energy - share of gas in total energy consumption\n55. greenhouse_gas_emissions - greenhouse gas emissions\n56. hydro_cons_change_pct - percentage change in hydro consumption\n57. hydro_cons_change_twh - change in hydro consumption in terawatt-hours\n58. hydro_consumption - total hydro consumption\n59. hydro_elec_per_capita - hydro electricity consumption per capita\n60. hydro_electricity - total hydro electricity consumption\n61. hydro_energy_per_capita - hydro energy consumption per capita\n62. hydro_share_elec - share of hydro in electricity generation\n63. hydro_share_energy - share of hydro in total energy consumption\n64. low_carbon_cons_change_pct - percentage change in low carbon consumption\n65. low_carbon_cons_change_twh - change in low carbon consumption in terawatt-hours\n66. low_carbon_consumption - total low carbon consumption\n67. low_carbon_elec_per_capita - low carbon electricity consumption per capita\n68. low_carbon_electricity - total low carbon electricity consumption\n69. low_carbon_energy_per_capita - low carbon energy consumption per capita\n70. low_carbon_share_elec - share of low carbon sources in electricity generation\n71. low_carbon_share_energy - share of low carbon sources in total energy consumption\n72. net_elec_imports - net electricity imports\n73. net_elec_imports_share_demand - share of net electricity imports in total demand\n74. nuclear_cons_change_pct - percentage change in nuclear consumption\n75. nuclear_cons_change_twh - change in nuclear consumption in terawatt-hours\n76. nuclear_consumption - total nuclear consumption\n77. nuclear_elec_per_capita - nuclear electricity consumption per capita\n78. nuclear_electricity - total nuclear electricity consumption\n79. nuclear_energy_per_capita - nuclear energy consumption per capita\n80. nuclear_share_elec - share of nuclear in electricity generation\n81. nuclear_share_energy - share of nuclear in total energy consumption\n82. oil_cons_change_pct - percentage change in oil consumption\n83. oil_cons_change_twh - change in oil consumption in terawatt-hours\n84. oil_consumption - total oil consumption\n85. oil_elec_per_capita - oil electricity consumption per capita\n86. oil_electricity - total oil electricity consumption\n87. oil_energy_per_capita - oil energy consumption per capita\n88. oil_prod_change_pct - percentage change in oil production\n89. oil_prod_change_twh - change in oil production in terawatt-hours\n90. oil_prod_per_capita - oil production per capita\n91. oil_production - total oil production\n92. oil_share_elec - share of oil in electricity generation\n93. oil_share_energy - share of oil in total energy consumption\n94. other_renewable_consumption - total consumption of other renewable energy sources\n95. other_renewable_electricity - total electricity generation from other renewable energy sources\n96. other_renewable_exc_biofuel_electricity - total electricity generation from other renewable energy sources excluding biofuels\n97. other_renewables_cons_change_pct - percentage change in other renewables consumption\n98. other_renewables_cons_change_twh - change in other renewables consumption in terawatt-hours\n99. other_renewables_elec_per_capita - other renewables electricity consumption per capita\n100. other_renewables_elec_per_capita_exc_biofuel - other renewables electricity consumption per capita excluding biofuels\n101. other_renewables_energy_per_capita - other renewables energy consumption per capita\n102. other_renewables_share_elec - share of other renewables in electricity generation\n103. other_renewables_share_elec_exc_biofuel - share of other renewables in electricity generation excluding biofuels\n104. other_renewables_share_energy - share of other renewables in total energy consumption\n105. per_capita_electricity - electricity consumption per capita\n106. primary_energy_consumption - total primary energy consumption\n107. renewables_cons_change_pct - percentage change in renewables consumption\n108. renewables_cons_change_twh - change in renewables consumption in terawatt-hours\n109. renewables_consumption - total renewables consumption\n110. renewables_elec_per_capita - renewables electricity consumption per capita\n111. renewables_electricity - total renewables electricity consumption\n112. renewables_energy_per_capita - renewables energy consumption per capita\n113. renewables_share_elec - share of renewables in electricity generation\n114. renewables_share_energy - share of renewables in total energy consumption\n115. solar_cons_change_pct - percentage change in solar consumption\n116. solar_cons_change_twh - change in solar consumption in terawatt-hours\n117. solar_consumption - total solar consumption\n118. solar_elec_per_capita - solar electricity consumption per capita\n119. solar_electricity - total solar electricity consumption\n120. solar_energy_per_capita - solar energy consumption per capita\n121. solar_share_elec - share of solar in electricity generation\n122. solar_share_energy - share of solar in total energy consumption\n123. wind_cons_change_pct - percentage change in wind consumption\n124. wind_cons_change_twh - change in wind consumption in terawatt-hours\n125. wind_consumption - total wind consumption\n126. wind_elec_per_capita - wind electricity consumption per capita\n127. wind_electricity - total wind electricity consumption\n128. wind_energy_per_capita - wind energy consumption per capita\n129. wind_share_elec - share of wind in electricity generation\n130. wind_share_energy - share of wind in total energy consumption\n\nThe data types for the attributes are not provided in the given metadata. However, based on the attribute names, it can be inferred that some attributes may be of numeric data types (e.g., population, gdp) while others may be percentages or ratios (e.g., share of different energy sources)."
    },
    "cat.csv": {
        "name": "cat.csv",
        "description": "The dataset provides information about the general fat level of cat's limbs."
    },
    "dog.csv": {
        "name": "dog.csv",
        "description": "The dataset provides information about dog food components and their nutrition level."
    },
    "colleges.csv": {
        "name": "colleges.csv",
        "description": "Based on the metadata provided, it can be inferred that the purpose of the dataset is to provide data about colleges. The dataset contains information about different files, including \"colleges.csv\" which is likely to contain data specifically about colleges."
    },
    "movies-w-year.csv": {
        "name": "movies-w-year.csv",
        "description": "The dataset 'movies-w-year.csv' includes information about different movies. The dataset has the following attributes:\n\n1. Title: The title of the movie. (Data type: String)\n2. Worldwide Gross: The total gross earnings of the movie worldwide. (Data type: Numeric)\n3. Production Budget: The budget allocated for producing the movie. (Data type: Numeric)\n4. Release Year: The year in which the movie was released. (Data type: Numeric)\n5. Content Rating: The rating given to the movie based on its content. (Data type: String)\n6. Running Time: The duration of the movie in minutes. (Data type: Numeric)\n7. Genre: The genre or category to which the movie belongs. (Data type: String)\n8. Creative Type: The type of creative work the movie represents. (Data type: String)\n9. Rotten Tomatoes Rating: The rating given to the movie on Rotten Tomatoes. (Data type: Numeric)\n10. IMDB Rating: The rating given to the movie on IMDB. (Data type: Numeric)\n\nOverall, the dataset provides information about various attributes of movies, such as their financial performance, release year, ratings, genre, and creative type."
    },
    "housing.csv": {
        "name": "housing.csv",
        "description": "The dataset is called \"housing.csv\". It contains information about California housing and related factors. The dataset has the following attributes:\n\n1. longitude: A measure of how far west a house is; a higher value is farther west\n2. latitude: A measure of how far north a house is; a higher value is farther north\n3. housingMedianAge: Median age of a house within a block; a lower number is a newer building\n4. totalRooms: Total number of rooms within a block\n5. totalBedrooms: Total number of bedrooms within a block\n6. population: Total number of people residing within a block\n7. households: Total number of households, a group of people residing within a home unit, for a block\n8. medianIncome: Median income for households within a block of houses (measured in tens of thousands of US Dollars)\n9. medianHouseValue: Median house value for households within a block (measured in US Dollars)\n10. oceanProximity: Location of the house w.r.t ocean/sea"
    },
    "Climate Change.csv": {
        "name": "Climate Change.csv",
        "description": "The dataset is called \"Climate Change.csv\" and it contains information related to climate change and various factors influencing it. The dataset includes the following data attributes:\n\n1. country_name: The name of the country (data type: string)\n2. date: The date for which the data is recorded (data type: string)\n3. Access to electricity (% of population): Percentage of the population with access to electricity (data type: float)\n4. Agricultural irrigated land (% of total agricultural land): Percentage of agricultural land that is irrigated (data type: float)\n5. Agricultural land (% of land area): Percentage of land area used for agriculture (data type: float)\n6. Agricultural land (sq. km): Total area of land used for agriculture in square kilometers (data type: float)\n7. Agriculture, forestry, and fishing, value added (% of GDP): Contribution of agriculture, forestry, and fishing to the GDP as a percentage (data type: float)\n8. Annual freshwater withdrawals, total (% of internal resources): Percentage of total freshwater withdrawals from internal resources (data type: float)\n9. Annual freshwater withdrawals, total (billion cubic meters): Total volume of freshwater withdrawals in billion cubic meters (data type: float)\n10. Arable land (% of land area): Percentage of land area suitable for growing crops (data type: float)\n11. Average precipitation in depth (mm per year): Average depth of precipitation in millimeters per year (data type: float)\n12. Cereal yield (kg per hectare): Yield of cereal crops (such as wheat, rice) in kilograms per hectare (data type: float)\n13. CO2 emissions (kg per 2015 US$ of GDP): CO2 emissions per 2015 US dollar of GDP (data type: float)\n14. CO2 emissions (kg per 2017 PPP $ of GDP): CO2 emissions per 2017 purchasing power parity dollar of GDP (data type: float)\n15. CO2 emissions (kg per PPP $ of GDP): CO2 emissions per purchasing power parity dollar of GDP (data type: float)\n16. CO2 emissions (kt): Total CO2 emissions in kilotons (data type: float)\n17. CO2 emissions (metric tons per capita): CO2 emissions per capita in metric tons (data type: float)\n18. CO2 emissions from gaseous fuel consumption (% of total): Percentage of CO2 emissions from gaseous fuel consumption out of total emissions (data type: float)\n19. CO2 emissions from gaseous fuel consumption (kt): CO2 emissions from gaseous fuel consumption in kilotons (data type: float)\n20. CO2 emissions from liquid fuel consumption (% of total): Percentage of CO2 emissions from liquid fuel consumption out of total emissions (data type: float)\n21. CO2 emissions from liquid fuel consumption (kt): CO2 emissions from liquid fuel consumption in kilotons (data type: float)\n22. CO2 emissions from solid fuel consumption (% of total): Percentage of CO2 emissions from solid fuel consumption out of total emissions (data type: float)\n23. CO2 emissions from solid fuel consumption (kt): CO2 emissions from solid fuel consumption in kilotons (data type: float)\n24. CO2 intensity (kg per kg of oil equivalent energy use): CO2 emissions intensity per kilogram of oil equivalent energy use (data type: float)\n25. Community health workers (per 1,000 people): Number of community health workers per 1,000 people (data type: float)\n26. CPIA public sector management and institutions cluster average (1=low to 6=high): Average score for the CPIA public sector management and institutions cluster (data type: float)\n27. Disaster risk reduction progress score (1-5 scale; 5=best): Score representing the progress in disaster risk reduction on a scale of 1 to 5 (data type: float)\n28. Droughts, floods, extreme temperatures (% of population, average 1990-2009): Percentage of the population affected by droughts, floods, and extreme temperatures on average from 1990 to 2009 (data type: float)\n29. Ease of doing business rank (1=most business-friendly regulations): Rank indicating the ease of doing business, with 1 representing the most business-friendly regulations (data type: float)\n30. Electric power consumption (kWh per capita): Electric power consumption per capita in kilowatt hours (data type: float)\n31. Electricity production from coal sources (% of total): Percentage of electricity production from coal sources out of total production (data type: float)\n32. Electricity production from hydroelectric sources (% of total): Percentage of electricity production from hydroelectric sources out of total production (data type: float)\n33. Electricity production from natural gas sources (% of total): Percentage of electricity production from natural gas sources out of total production (data type: float)\n34. Electricity production from nuclear sources (% of total): Percentage of electricity production from nuclear sources out of total production (data type: float)\n35. Electricity production from oil sources (% of total): Percentage of electricity production from oil sources out of total production (data type: float)\n36. Electricity production from renewable sources, excluding hydroelectric (% of total): Percentage of electricity production from renewable sources, excluding hydroelectric, out of total production (data type: float)\n37. Electricity production from renewable sources, excluding hydroelectric (kWh): Electricity production from renewable sources, excluding hydroelectric, in kilowatt hours (data type: float)\n38. Energy use (kg of oil equivalent per capita): Energy use per capita in kilograms of oil equivalent (data type: float)\n39. Energy use (kg of oil equivalent) per $1,000 GDP (constant 2017 PPP): Energy use per $1,000 GDP (constant 2017 purchasing power parity) in kilograms of oil equivalent (data type: float)\n40. Foreign direct investment, net inflows (% of GDP): Net inflows of foreign direct investment as a percentage of GDP (data type: float)\n41. Forest area (% of land area): Percentage of land area covered by forests (data type: float)\n42. Forest area (sq. km): Total area of land covered by forests in square kilometers (data type: float)\n43. GHG net emissions/removals by LUCF (Mt of CO2 equivalent): Net greenhouse gas emissions/removals by land use, land-use change, and forestry in million metric tons of CO2 equivalent (data type: float)\n44. HFC gas emissions (thousand metric tons of CO2 equivalent): HFC (hydrofluorocarbon) gas emissions in thousand metric tons of CO2 equivalent (data type: float)\n45. Land area where elevation is below 5 meters (% of total land area): Percentage of total land area where elevation is below 5 meters (data type: float)\n46. Marine protected areas (% of territorial waters): Percentage of territorial waters designated as marine protected areas (data type: float)\n47. Methane emissions (% change from 1990): Percentage change in methane emissions since 1990 (data type: float)\n48. Methane emissions (kt of CO2 equivalent): Methane emissions in kilotons of CO2 equivalent (data type: float)\n49. Mortality rate, under-5 (per 1,000 live births): Mortality rate for children under 5 years old per 1,000 live births (data type: float)\n50. Nitrous oxide emissions (% change from 1990): Percentage change in nitrous oxide emissions since 1990 (data type: float)\n51. Nitrous oxide emissions (thousand metric tons of CO2 equivalent): Nitrous oxide emissions in thousand metric tons of CO2 equivalent (data type: float)\n52. Other greenhouse gas emissions (% change from 1990): Percentage change in other greenhouse gas emissions since 1990 (data type: float)\n53. Other greenhouse gas emissions, HFC, PFC and SF6 (thousand metric tons of CO2 equivalent): Other greenhouse gas emissions including HFC (hydrofluorocarbon), PFC (perfluorocarbon), and SF6 (sulfur hexafluoride) in thousand metric tons of CO2 equivalent (data type: float)\n54. PFC gas emissions (thousand metric tons of CO2 equivalent): PFC (perfluorocarbon) gas emissions in thousand metric tons of CO2 equivalent (data type: float)\n55. Population growth (annual %): Annual percentage population growth (data type: float)\n56. Population in urban agglomerations of more than 1 million (% of total population): Percentage of the total population living in urban agglomerations with more than 1 million inhabitants (data type: float)\n57. Population living in areas where elevation is below 5 meters (% of total population): Percentage of the total population living in areas where elevation is below 5 meters (data type: float)\n58. Population, total: Total population of the country (data type: integer)\n59. Poverty headcount ratio at $2.15 a day (2017 PPP) (% of population): Percentage of the population living below the poverty line of $2.15 per day (purchasing power parity) in 2017 (data type: float)\n60. Prevalence of underweight, weight for age (% of children under 5): Percentage of children under 5 years old who are underweight for their age (data type: float)\n61. Primary completion rate, total (% of relevant age group): Percentage of the relevant age group that has completed primary education (data type: float)\n62. Renewable electricity output (% of total electricity output): Percentage of electricity output from renewable sources out of total electricity output (data type: float)\n63. Renewable energy consumption (% of total final energy consumption): Percentage of total final energy consumption derived from renewable sources (data type: float)\n64. Rural land area where elevation is below 5 meters (% of total land area): Percentage of total rural land area where elevation is below 5 meters (data type: float)\n65. Rural land area where elevation is below 5 meters (sq. km): Total area of rural land where elevation is below 5 meters in square kilometers (data type: float)\n66. Rural population living in areas where elevation is below 5 meters (% of total population): Percentage of the total rural population living in areas where elevation is below 5 meters (data type: float)\n67. School enrollment, primary and secondary (gross), gender parity index (GPI): Gender parity index for gross primary and secondary school enrollment (data type: float)\n68. SF6 gas emissions (thousand metric tons of CO2 equivalent): SF6 (sulfur hexafluoride) gas emissions in thousand metric tons of CO2 equivalent (data type: float)\n69. Terrestrial and marine protected areas (% of total territorial area): Percentage of total territorial area designated as terrestrial and marine protected areas (data type: float)\n70. Terrestrial protected areas (% of total land area): Percentage of land area designated as terrestrial protected areas (data type: float)\n71. Total greenhouse gas emissions (% change from 1990): Percentage change in total greenhouse gas emissions since 1990 (data type: float)\n72. Total greenhouse gas emissions (kt of CO2 equivalent): Total greenhouse gas emissions in kilotons of CO2 equivalent (data type: float)\n73. Urban land area where elevation is below 5 meters (% of total land area): Percentage of total urban land area where elevation is below 5 meters (data type: float)\n74. Urban land area where elevation is below 5 meters (sq. km): Total area of urban land where elevation is below 5 meters in square kilometers (data type: float)\n75. Urban population: Total urban population (data type: integer)\n76. Urban population (% of total population): Percentage of the total population living in urban areas (data type: float)\n77. Urban population growth (annual %): Annual percentage urban population growth (data type: float)\n78. Urban population living in areas where elevation is below 5 meters (% of total population): Percentage of the total urban population living in areas where elevation is below 5 meters (data type: float)"
    },
    "Education.csv": {
        "name": "Education.csv",
        "description": "The dataset is called \"Education.csv\" and it contains information related to education statistics. The dataset includes the following attributes:\n\n1. country_name: The name of the country (data type: string)\n2. date: The date of the data (data type: string)\n3. Adjusted net enrollment rate, primary, female (% of primary school age children): The adjusted net enrollment rate for primary education for females as a percentage of primary school-age children (data type: float)\n4. Adjusted net enrollment rate, primary, male (% of primary school age children): The adjusted net enrollment rate for primary education for males as a percentage of primary school-age children (data type: float)\n5. Adolescents out of school (% of lower secondary school age): The percentage of adolescents out of school at the lower secondary school age (data type: float)\n6. Adolescents out of school, female (% of female lower secondary school age): The percentage of female adolescents out of school at the lower secondary school age (data type: float)\n7. Children out of school, primary, male: The number of male children out of school at the primary school age (data type: float)\n8. Current education expenditure, primary (% of total expenditure in primary public institutions): The current education expenditure for primary education as a percentage of the total expenditure in primary public institutions (data type: float)\n9. Current education expenditure, total (% of total expenditure in public institutions): The current education expenditure for all levels of education as a percentage of the total expenditure in public institutions (data type: float)\n10. Educational attainment, at least Bachelor's or equivalent, population 25+, male (%) (cumulative): The cumulative percentage of males in the population aged 25 and above who have attained at least a Bachelor's degree or its equivalent (data type: float)\n\nThe list continues with several more attributes related to educational attainment, school enrollment rates, literacy rates, teacher ratios, and other education-related metrics. Each attribute has a specific data type."
    },
    "Energy & Mining.csv": {
        "name": "Energy & Mining.csv",
        "description": "The dataset is named \"Energy & Mining.csv\" and contains information related to energy and mining industries. \n\nThe dataset has the following data attributes, along with their data type and description:\n1. country_name: (String) The name of the country.\n2. date: (Date) The date of the observation.\n3. Access to electricity (% of population): (Numeric) Percentage of the population with access to electricity.\n4. Access to electricity, rural (% of rural population): (Numeric) Percentage of the rural population with access to electricity.\n5. Access to electricity, urban (% of urban population): (Numeric) Percentage of the urban population with access to electricity.\n6. Adjusted savings: energy depletion (% of GNI): (Numeric) Percentage of adjusted savings representing energy depletion in relation to Gross National Income (GNI).\n7. Adjusted savings: energy depletion (current US$): (Numeric) Current US dollar value of adjusted savings representing energy depletion.\n8. Adjusted savings: mineral depletion (% of GNI): (Numeric) Percentage of adjusted savings representing mineral depletion in relation to GNI.\n9. Adjusted savings: mineral depletion (current US$): (Numeric) Current US dollar value of adjusted savings representing mineral depletion.\n10. Adjusted savings: natural resources depletion (% of GNI): (Numeric) Percentage of adjusted savings representing natural resources depletion in relation to GNI.\n11. Alternative and nuclear energy (% of total energy use): (Numeric) Percentage of alternative and nuclear energy in total energy use.\n12. CO2 emissions from gaseous fuel consumption (% of total): (Numeric) Percentage of CO2 emissions from gaseous fuel consumption in total emissions.\n13. CO2 emissions from liquid fuel consumption (kt): (Numeric) Total CO2 emissions from liquid fuel consumption in kilotons.\n14. Combustible renewables and waste (% of total energy): (Numeric) Percentage of energy derived from combustible renewables and waste in total energy consumption.\n15. Electric power consumption (kWh per capita): (Numeric) Kilowatt-hour (kWh) of electric power consumption per capita.\n16. Electric power transmission and distribution losses (% of output): (Numeric) Percentage of electric power transmission and distribution losses in relation to output.\n17. Electricity production from coal sources (% of total): (Numeric) Percentage of electricity production sourced from coal in total electricity production.\n18. Electricity production from hydroelectric sources (% of total): (Numeric) Percentage of electricity production sourced from hydroelectric sources in total electricity production.\n19. Electricity production from natural gas sources (% of total): (Numeric) Percentage of electricity production sourced from natural gas in total electricity production.\n20. Electricity production from nuclear sources (% of total): (Numeric) Percentage of electricity production sourced from nuclear sources in total electricity production.\n21. Electricity production from oil sources (% of total): (Numeric) Percentage of electricity production sourced from oil in total electricity production.\n22. Electricity production from oil, gas, and coal sources (% of total): (Numeric) Percentage of electricity production sourced from oil, gas, and coal in total electricity production.\n23. Electricity production from renewable sources, excluding hydroelectric (% of total): (Numeric) Percentage of electricity production sourced from renewable sources, excluding hydroelectric, in total electricity production.\n24. Electricity production from renewable sources, excluding hydroelectric (kWh): (Numeric) Kilowatt-hour (kWh) of electricity production sourced from renewable sources, excluding hydroelectric.\n25. Energy imports, net (% of energy use): (Numeric) Percentage of net energy imports in relation to energy use.\n26. Energy intensity level of primary energy (MJ/$2017 PPP GDP): (Numeric) Energy intensity level of primary energy in megajoules per 2017 PPP GDP.\n27. Energy-related methane emissions (% of total): (Numeric) Percentage of energy-related methane emissions in total emissions.\n28. Energy use (kg of oil equivalent per capita): (Numeric) Kilograms of oil equivalent energy use per capita.\n29. Energy use (kg of oil equivalent) per $1,000 GDP (constant 2017 PPP): (Numeric) Kilograms of oil equivalent energy use per $1,000 constant 2017 PPP GDP.\n30. Firms using banks to finance investment (% of firms): (Numeric) Percentage of firms using banks to finance investment.\n31. Fossil fuel energy consumption (% of total): (Numeric) Percentage of energy consumption derived from fossil fuels in total energy consumption.\n32. Fuel exports (% of merchandise exports): (Numeric) Percentage of fuel exports in relation to merchandise exports.\n33. Fuel imports (% of merchandise imports): (Numeric) Percentage of fuel imports in relation to merchandise imports.\n34. GDP per unit of energy use (constant 2017 PPP $ per kg of oil equivalent): (Numeric) GDP per unit of energy use in constant 2017 PPP dollars per kilogram of oil equivalent.\n35. GDP per unit of energy use (PPP $ per kg of oil equivalent): (Numeric) GDP per unit of energy use in PPP dollars per kilogram of oil equivalent.\n36. Investment in energy with private participation (current US$): (Numeric) Current US dollar value of investment in energy with private participation.\n37. Methane emissions in the energy sector (thousand metric tons of CO2 equivalent): (Numeric) Methane emissions in the energy sector measured in thousand metric tons of CO2 equivalent.\n38. Mineral rents (% of GDP): (Numeric) Percentage of mineral rents in relation to GDP.\n39. Natural gas rents (% of GDP): (Numeric) Percentage of natural gas rents in relation to GDP.\n40. Nitrous oxide emissions in energy sector (% of total): (Numeric) Percentage of nitrous oxide emissions in the energy sector in total emissions.\n41. Nitrous oxide emissions in the energy sector (thousand metric tons of CO2 equivalent): (Numeric) Nitrous oxide emissions in the energy sector measured in thousand metric tons of CO2 equivalent.\n42. Oil rents (% of GDP): (Numeric) Percentage of oil rents in relation to GDP.\n43. Ores and metals exports (% of merchandise exports): (Numeric) Percentage of ores and metals exports in relation to merchandise exports.\n44. Ores and metals imports (% of merchandise imports): (Numeric) Percentage of ores and metals imports in relation to merchandise imports.\n45. Pump price for diesel fuel (US$ per liter): (Numeric) Pump price for diesel fuel in US dollars per liter.\n46. Pump price for gasoline (US$ per liter): (Numeric) Pump price for gasoline in US dollars per liter.\n47. Renewable electricity output (% of total electricity output): (Numeric) Percentage of renewable electricity output in relation to total electricity output.\n48. Renewable energy consumption (% of total final energy consumption): (Numeric) Percentage of renewable energy consumption in relation to total final energy consumption.\n49. Time required to get electricity (days): (Numeric) Number of days required to get electricity.\n50. Time to obtain an electrical connection (days): (Numeric) Number of days required to obtain an electrical connection.\n51. Total natural resources rents (% of GDP): (Numeric) Percentage of total natural resources rents in relation to GDP.\n52. Value lost due to electrical outages (% of sales for affected firms): (Numeric) Percentage of value lost due to electrical outages in relation to sales for affected firms."
    },
    "External Debt.csv": {
        "name": "External Debt.csv",
        "description": "The dataset is called \"External Debt.csv\". It contains information about various aspects of external debt for different countries. The attributes in the dataset include:\n\n1. country_name: The name of the country.\n   - Data type: String\n   - Description: Identifies the country to which the data belongs.\n\n2. date: The date of the recorded data.\n   - Data type: String\n   - Description: Specifies the time period for which the data is applicable.\n\n3. Commercial banks and other lending (PPG + PNG) (NFL, current US$): Amount of debt from commercial banks and other lenders.\n   - Data type: Numeric (current US$)\n   - Description: Indicates the level of debt obtained from commercial banks and other lending sources.\n\n4. Current account balance (BoP, current US$): Balance of trade in goods, services, and primary income.\n   - Data type: Numeric (current US$)\n   - Description: Represents the difference between a country's total exports and imports.\n\n5. Debt service (PPG and IMF only, % of exports of goods, services and primary income): Percentage of debt service payments in relation to exports.\n   - Data type: Numeric (%)\n   - Description: Indicates the proportion of a country's exports used to pay off debt.\n\n6. Debt service on external debt, public and publicly guaranteed (PPG) (TDS, current US$): Debt service payments on public and publicly guaranteed external debt.\n   - Data type: Numeric (current US$)\n   - Description: Represents the amount of money allocated for debt service payments on public and publicly guaranteed external debt.\n\n[Continued...]"
    },
    "Financial Sector.csv": {
        "name": "Financial Sector.csv",
        "description": "The dataset is about the financial sector and contains information on various attributes related to financial services and indicators. \n\nThe data attributes include:\n1. country_name: string - the name of the country\n2. date: string - the date of the data entry\n3. Account ownership at a financial institution or with a mobile-money-service provider (% of population ages 15+): float - the percentage of the population above the age of 15 who have an account at a financial institution or with a mobile-money-service provider\n4. Account ownership at a financial institution or with a mobile-money-service provider, female (% of population ages 15+): float - the percentage of female population above the age of 15 who have an account at a financial institution or with a mobile-money-service provider\n5. Account ownership at a financial institution or with a mobile-money-service provider, male (% of population ages 15+): float - the percentage of male population above the age of 15 who have an account at a financial institution or with a mobile-money-service provider\n6. Account ownership at a financial institution or with a mobile-money-service provider, older adults (% of population ages 25+): float - the percentage of population above the age of 25 who have an account at a financial institution or with a mobile-money-service provider\n7. Account ownership at a financial institution or with a mobile-money-service provider, poorest 40% (% of population ages 15+): float - the percentage of the poorest 40% of the population above the age of 15 who have an account at a financial institution or with a mobile-money-service provider\n8. Account ownership at a financial institution or with a mobile-money-service provider, primary education or less (% of population ages 15+): float - the percentage of population above the age of 15 with primary education or less who have an account at a financial institution or with a mobile-money-service provider\n9. Account ownership at a financial institution or with a mobile-money-service provider, richest 60% (% of population ages 15+): float - the percentage of the richest 60% of the population above the age of 15 who have an account at a financial institution or with a mobile-money-service provider\n10. Account ownership at a financial institution or with a mobile-money-service provider, secondary education or more (% of population ages 15+): float - the percentage of the population above the age of 15 with secondary education or more who have an account at a financial institution or with a mobile-money-service provider\n11. Account ownership at a financial institution or with a mobile-money-service provider, young adults (% of population ages 15-24): float - the percentage of young adults (ages 15-24) who have an account at a financial institution or with a mobile-money-service provider\n12. Automated teller machines (ATMs) (per 100,000 adults): float - the number of automated teller machines per 100,000 adults\n13. Average transaction cost of sending remittances from a specific country (%): float - the average transaction cost of sending remittances from a specific country as a percentage\n14. Average transaction cost of sending remittances to a specific country (%): float - the average transaction cost of sending remittances to a specific country as a percentage\n15. Bank capital to assets ratio (%): float - the ratio of bank capital to total bank assets as a percentage\n16. Bank liquid reserves to bank assets ratio (%): float - the ratio of bank liquid reserves to total bank assets as a percentage\n17. Bank nonperforming loans to total gross loans (%): float - the ratio of nonperforming loans to total gross loans as a percentage\n18. Borrowers from commercial banks (per 1,000 adults): float - the number of borrowers from commercial banks per 1,000 adults\n19. Broad money (% of GDP): float - the ratio of broad money (currency and demand deposits plus time and savings deposits) to GDP as a percentage\n20. Broad money (current LCU): float - the total amount of broad money in the local currency unit (LCU)\n21. Broad money growth (annual %): float - the annual growth rate of broad money as a percentage\n22. Broad money to total reserves ratio: float - the ratio of broad money to total reserves\n23. Claims on central government (annual growth as % of broad money): float - the annual growth rate of claims on central government as a percentage of broad money\n24. Claims on central government, etc. (% GDP): float - the ratio of claims on central government and other sectors to GDP as a percentage\n25. Claims on other sectors of the domestic economy (% of GDP): float - the ratio of claims on other sectors of the domestic economy to GDP as a percentage\n26. Claims on other sectors of the domestic economy (annual growth as % of broad money): float - the annual growth rate of claims on other sectors of the domestic economy as a percentage of broad money\n27. Claims on private sector (annual growth as % of broad money): float - the annual growth rate of claims on private sector as a percentage of broad money\n28. Commercial bank branches (per 100,000 adults): float - the number of commercial bank branches per 100,000 adults\n29. Consumer price index (2010 = 100): float - the consumer price index relative to the year 2010\n30. DEC alternative conversion factor (LCU per US$): float - the alternative conversion factor from the local currency unit (LCU) to US dollars\n31. Deposit interest rate (%): float - the interest rate on deposits as a percentage\n32. Depositors with commercial banks (per 1,000 adults): float - the number of depositors with commercial banks per 1,000 adults\n33. Depth of credit information index (0=low to 8=high): float - an index indicating the depth of credit information on a scale of 0 to 8\n34. Domestic credit provided by financial sector (% of GDP): float - the ratio of domestic credit provided by the financial sector to GDP as a percentage\n35. Domestic credit to private sector (% of GDP): float - the ratio of domestic credit to the private sector to GDP as a percentage\n36. Domestic credit to private sector by banks (% of GDP): float - the ratio of domestic credit to the private sector provided by banks to GDP as a percentage\n37. Foreign direct investment, net (BoP, current US$): float - the net foreign direct investment in current US dollars (Balance of Payments)\n38. Foreign direct investment, net inflows (% of GDP): float - the net inflows of foreign direct investment as a percentage of GDP\n39. Foreign direct investment, net inflows (BoP, current US$): float - the net inflows of foreign direct investment in current US dollars (Balance of Payments)\n40. Foreign direct investment, net outflows (% of GDP): float - the net outflows of foreign direct investment as a percentage of GDP\n41. Foreign direct investment, net outflows (BoP, current US$): float - the net outflows of foreign direct investment in current US dollars (Balance of Payments)\n42. GDP deflator: linked series (base year varies by country): float - the GDP deflator based on a linked series with the base year varying by country\n43. Inflation, consumer prices (annual %): float - the annual inflation rate of consumer prices as a percentage\n44. Inflation, GDP deflator: linked series (annual %): float - the annual inflation rate of GDP deflator based on a linked series as a percentage\n45. Interest rate spread (lending rate minus deposit rate, %): float - the difference between lending rate and deposit rate as a percentage\n46. International migrant stock (% of population): float - the percentage of the international migrant stock in the total population\n47. International migrant stock, total: int - the total number of international migrants\n48. Lending interest rate (%): float - the interest rate on lending as a percentage\n49. Listed domestic companies, total: int - the total number of listed domestic companies\n50. Market capitalization of listed domestic companies (% of GDP): float - the market capitalization of listed domestic companies relative to GDP as a percentage\n51. Market capitalization of listed domestic companies (current US$): float - the market capitalization of listed domestic companies in current US dollars\n52. Monetary Sector credit to private sector (% GDP): float - the ratio of credit to the private sector provided by the monetary sector to GDP as a percentage\n53. Net domestic credit (current LCU): float - the net domestic credit in the local currency unit (LCU)\n54. Net foreign assets (current LCU): float - the net foreign assets in the local currency unit (LCU)\n55. Net migration: float - the net migration rate\n56. Official exchange rate (LCU per US$, period average): float - the official exchange rate of the local currency unit (LCU) per US dollar\n57. Personal remittances, paid (current US$): float - the total amount of personal remittances paid in current US dollars\n58. Personal remittances, received (% of GDP): float - the total amount of personal remittances received as a percentage of GDP\n59. Personal remittances, received (current US$): float - the total amount of personal remittances received in current US dollars\n60. Personal transfers, receipts (BoP, current US$): float - the total amount of personal transfers received in current US dollars (Balance of Payments)\n61. Portfolio equity, net inflows (BoP, current US$): float - the net inflows of portfolio equity in current US dollars (Balance of Payments)\n62. Portfolio investment, bonds (PPG + PNG) (NFL, current US$): float - the total portfolio investment in bonds (Public and publicly guaranteed debt + Private non-guaranteed debt) in current US dollars (Net Financial Liabilities)\n63. Portfolio investment, net (BoP, current US$): float - the net portfolio investment in current US dollars (Balance of Payments)\n64. Private credit bureau coverage (% of adults): float - the percentage of adults covered by private credit bureaus\n65. Public credit registry coverage (% of adults): float - the percentage of adults covered by public credit registries\n66. Real effective exchange rate index (2010 = 100): float - the real effective exchange rate index relative to the year 2010\n67. Real interest rate (%): float - the real interest rate as a percentage\n68. Risk premium on lending (lending rate minus treasury bill rate, %): float - the difference between the lending rate and the treasury bill rate as a percentage\n69. S&P Global Equity Indices (annual % change): float - the annual percentage change in the S&P Global Equity Indices\n70. Stocks traded, total value (% of GDP): float - the total value of stocks traded relative to GDP as a percentage\n71. Stocks traded, total value (current US$): float - the total value of stocks traded in current US dollars\n72. Stocks traded, turnover ratio of domestic shares (%): float - the turnover ratio of domestic shares traded as a percentage\n73. Strength of legal rights index (0=weak to 12=strong): float - an index indicating the strength of legal rights on a scale of 0 to 12\n74. Total reserves (% of total external debt): float - the ratio of total reserves to total external debt as a percentage\n75. Total reserves (includes gold, current US$): float - the total reserves including gold in current US dollars\n76. Total reserves in months of imports: float - the total reserves expressed in months of imports\n77. Total reserves minus gold (current US$): float - the total reserves excluding gold in current US dollars\n78. Wholesale price index (2010 = 100): float - the wholesale price index relative to the year 2010"
    },
    "Gender.csv": {
        "name": "Gender.csv",
        "description": "The dataset is named \"Gender.csv\" and contains a wide range of data attributes related to gender and various aspects of social, economic, and educational factors. The data attributes include:\n\n1. country_name (String): The name of the country.\n2. date (Date): The date the data was collected.\n3. Adjusted net enrollment rate, primary, female (% of primary school age children) (Numeric): The percentage of primary school-age girls enrolled in school.\n4. Adjusted net enrollment rate, primary, male (% of primary school age children) (Numeric): The percentage of primary school-age boys enrolled in school.\n5. Child employment in manufacturing, female (% of female economically active children ages 7-14) (Numeric): The percentage of economically active girls aged 7-14 engaged in manufacturing work.\n6. Child employment in manufacturing, male (% of male economically active children ages 7-14) (Numeric): The percentage of economically active boys aged 7-14 engaged in manufacturing work.\n7. Child employment in services, female (% of female economically active children ages 7-14) (Numeric): The percentage of economically active girls aged 7-14 engaged in service work.\n8. Child employment in services, male (% of male economically active children ages 7-14) (Numeric): The percentage of economically active boys aged 7-14 engaged in service work.\n9. Children in employment, female (% of female children ages 7-14) (Numeric): The percentage of girls aged 7-14 in employment.\n10. Children in employment, male (% of male children ages 7-14) (Numeric): The percentage of boys aged 7-14 in employment.\n11. Children in employment, work only, male (% of male children in employment, ages 7-14) (Numeric): The percentage of boys aged 7-14 engaged in work only.\n12. Children out of school, primary, male (Numeric): The number of primary school-age boys out of school.\n13. Condom use, population ages 15-24, male (% of males ages 15-24) (Numeric): The percentage of males aged 15-24 who use condoms in sexual activities.\n14. Contributing family workers, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female workers engaged in contributing family work.\n15. Educational attainment, at least Bachelor's or equivalent, population 25+, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above with at least a Bachelor's degree.\n16. Educational attainment, at least completed lower secondary, population 25+, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above who have completed lower secondary education.\n17. Educational attainment, at least completed lower secondary, population 25+, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above who have completed lower secondary education.\n18. Educational attainment, at least completed lower secondary, population 25+, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above who have completed lower secondary education.\n19. Educational attainment, at least completed post-secondary, population 25+, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above who have completed post-secondary education.\n20. Educational attainment, at least completed post-secondary, population 25+, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above who have completed post-secondary education.\n21. Educational attainment, at least completed post-secondary, population 25+, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above who have completed post-secondary education.\n22. Educational attainment, at least completed short-cycle tertiary, population 25+, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above who have completed short-cycle tertiary education.\n23. Educational attainment, at least completed short-cycle tertiary, population 25+, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above who have completed short-cycle tertiary education.\n24. Educational attainment, at least completed short-cycle tertiary, population 25+, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above who have completed short-cycle tertiary education.\n25. Educational attainment, at least Master's or equivalent, population 25+, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above with at least a Master's degree or equivalent.\n26. Educational attainment, at least Master's or equivalent, population 25+, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above with at least a Master's degree or equivalent.\n27. Educational attainment, at least Master's or equivalent, population 25+, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above with at least a Master's degree or equivalent.\n28. Educational attainment, Doctoral or equivalent, population 25+, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above with a Doctoral or equivalent degree.\n29. Educational attainment, Doctoral or equivalent, population 25+, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above with a Doctoral or equivalent degree.\n30. Employment in agriculture, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female employment in the agriculture sector.\n31. Employment in services, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female employment in the services sector.\n32. Employment in services, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male employment in the services sector.\n33. Employment to population ratio, ages 15-24, female (%) (modeled ILO estimate) (Numeric): The percentage of females aged 15-24 who are employed relative to the total population in that age range.\n34. Employment to population ratio, ages 15-24, male (%) (modeled ILO estimate) (Numeric): The percentage of males aged 15-24 who are employed relative to the total population in that age range.\n35. Female headed households (% of households with a female head) (Numeric): The percentage of households with a female as the head.\n36. Firms with female top manager (% of firms) (Numeric): The percentage of firms with a female top manager.\n37. Gross intake ratio in first grade of primary education, female (% of relevant age group) (Numeric): The ratio of girls enrolled in the first grade of primary education to the total relevant age group.\n38. Gross intake ratio in first grade of primary education, male (% of relevant age group) (Numeric): The ratio of boys enrolled in the first grade of primary education to the total relevant age group.\n39. Life expectancy at birth, male (years) (Numeric): The average number of years a newborn male is expected to live.\n40. Lifetime risk of maternal death (1 in: rate varies by country) (Numeric): The estimated lifetime risk of maternal death for women in a given country.\n41. Literacy rate, adult female (% of females ages 15 and above) (Numeric): The percentage of females aged 15 and above who can read and write.\n42. Literacy rate, adult male (% of males ages 15 and above) (Numeric): The percentage of males aged 15 and above who can read and write.\n43. Literacy rate, youth (ages 15-24), gender parity index (GPI) (Numeric): The ratio of the literacy rates between youth females and males.\n44. Literacy rate, youth male (% of males ages 15-24) (Numeric): The percentage of males aged 15-24 who can read and write.\n45. Persistence to grade 5, female (% of cohort) (Numeric): The percentage of girls who complete up to grade 5 out of the total cohort.\n46. Persistence to last grade of primary, female (% of cohort) (Numeric): The percentage of girls who persist until the last grade of primary school out of the total cohort.\n47. Persistence to last grade of primary, male (% of cohort) (Numeric): The percentage of boys who persist until the last grade of primary school out of the total cohort.\n48. Prevalence of current tobacco use, males (% of male adults) (Numeric): The percentage of male adults who currently use tobacco.\n49. Prevalence of HIV, male (% ages 15-24) (Numeric): The percentage of males aged 15-24 who have HIV.\n50. Prevalence of underweight, weight for age, female (% of children under 5) (Numeric): The percentage of girls under the age of 5 who are underweight.\n51. Primary education, teachers (% female) (Numeric): The percentage of primary school teachers who are female.\n52. Progression to secondary school, female (%) (Numeric): The percentage of girls who progress to secondary school from primary school.\n53. Proportion of seats held by women in national parliaments (%) (Numeric): The percentage of seats in the national parliament held by women.\n54. Proportion of time spent on unpaid domestic and care work, female (% of 24 hour day) (Numeric): The percentage of a female's 24-hour day spent on unpaid domestic and care work.\n55. Proportion of time spent on unpaid domestic and care work, male (% of 24 hour day) (Numeric): The percentage of a male's 24-hour day spent on unpaid domestic and care work.\n56. School enrollment, primary and secondary (gross), gender parity index (GPI) (Numeric): The ratio of the gross enrollment rates between primary and secondary school for both genders.\n57. School enrollment, primary, female (% gross) (Numeric): The percentage of girls enrolled in primary school relative to the total population of primary school age.\n58. School enrollment, primary, female (% net) (Numeric): The percentage of girls enrolled in primary school relative to the total population of primary school age, adjusted for repeaters and over-aged students.\n59. School enrollment, primary, male (% gross) (Numeric): The percentage of boys enrolled in primary school relative to the total population of primary school age.\n60. School enrollment, primary, male (% net) (Numeric): The percentage of boys enrolled in primary school relative to the total population of primary school age, adjusted for repeaters and over-aged students.\n61. School enrollment, secondary, female (% gross) (Numeric): The percentage of girls enrolled in secondary school relative to the total population of secondary school age.\n62. School enrollment, secondary, female (% net) (Numeric): The percentage of girls enrolled in secondary school relative to the total population of secondary school age, adjusted for repeaters and over-aged students.\n63. School enrollment, tertiary (gross), gender parity index (GPI) (Numeric): The ratio of the gross enrollment rates between tertiary education for both genders.\n64. Secondary education, general pupils (% female) (Numeric): The percentage of general pupils in secondary education who are female.\n65. Secondary education, vocational pupils (% female) (Numeric): The percentage of vocational pupils in secondary education who are female.\n66. Self-employed, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female workers who are self-employed.\n67. Survival to age 65, male (% of cohort) (Numeric): The percentage of males who survive until the age of 65 out of the total cohort.\n68. Teenage mothers (% of women ages 15-19 who have had children or are currently pregnant) (Numeric): The percentage of women aged 15-19 who are mothers or currently pregnant.\n69. Unemployment, youth female (% of female labor force ages 15-24) (modeled ILO estimate) (Numeric): The percentage of unemployed females in the labor force aged 15-24.\n70. Unemployment, youth male (% of male labor force ages 15-24) (modeled ILO estimate) (Numeric): The percentage of unemployed males in the labor force aged 15-24.\n71. Vulnerable employment, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female employment in vulnerable employment.\n72. Vulnerable employment, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male employment in vulnerable employment.\n73. Wanted fertility rate (births per woman) (Numeric): The desired number of children per woman.\n74. Women Business and the Law Index Score (scale 1-100) (Numeric): A score representing the legal barriers faced by women in various aspects of business and the law.\n75. Women making their own informed decisions regarding sexual relations, contraceptive use and reproductive health care (% of women age 15-49) (Numeric): The percentage of women aged 15-49 who are able to make their own informed decisions regarding sexual relations, contraceptive use, and reproductive health care.\n76. Women participating in the three decisions (own health care, major household purchases, and visiting family) (% of women age 15-49) (Numeric): The percentage of women aged 15-49 who participate in making decisions regarding their own health care, major household purchases, and visiting family.\n77. Women who believe a husband is justified in beating his wife when she burns the food (%) (Numeric): The percentage of women who believe a husband is justified in beating his wife when she burns the food.\n78. Women who believe a husband is justified in beating his wife when she goes out without telling him (%) (Numeric): The percentage of women who believe a husband is justified in beating his wife when she goes out without telling him.\n79. Women who believe a husband is justified in beating his wife when she neglects the children (%) (Numeric): The percentage of women who believe a husband is justified in beating his wife when she neglects the children.\n80. Women's share of population ages 15+ living with HIV (%) (Numeric): The percentage of the population aged 15 and above with HIV who are female.\n81. Adolescent fertility rate (births per 1,000 women ages 15-19) (Numeric): The number of births per 1,000 women aged 15-19.\n82. Births attended by skilled health staff (% of total) (Numeric): The percentage of births attended by skilled health staff out of the total number of births.\n83. Child employment in agriculture, female (% of female economically active children ages 7-14) (Numeric): The percentage of economically active girls aged 7-14 engaged in agricultural work.\n84. Child employment in agriculture, male (% of male economically active children ages 7-14) (Numeric): The percentage of economically active boys aged 7-14 engaged in agricultural work.\n85. Children in employment, study and work, female (% of female children in employment, ages 7-14) (Numeric): The percentage of girls aged 7-14 engaged in study and work while in employment.\n86. Children in employment, study and work, male (% of male children in employment, ages 7-14) (Numeric): The percentage of boys aged 7-14 engaged in study and work while in employment.\n87. Children in employment, work only, female (% of female children in employment, ages 7-14) (Numeric): The percentage of girls aged 7-14 engaged in work only while in employment.\n88. Children out of school, primary, female (Numeric): The number of primary school-age girls out of school.\n89. Condom use, population ages 15-24, female (% of females ages 15-24) (Numeric): The percentage of females aged 15-24 who use condoms in sexual activities.\n90. Contraceptive prevalence, any method (% of married women ages 15-49) (Numeric): The percentage of married women aged 15-49 who use any contraceptive method.\n91. Contributing family workers, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male workers engaged in contributing family work.\n92. Educational attainment, at least Bachelor's or equivalent, population 25+, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above with at least a Bachelor's degree or equivalent.\n93. Educational attainment, at least Bachelor's or equivalent, population 25+, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above with at least a Bachelor's degree or equivalent.\n94. Educational attainment, at least completed primary, population 25+ years, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above who have completed primary education.\n95. Educational attainment, at least completed primary, population 25+ years, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above who have completed primary education.\n96. Educational attainment, at least completed primary, population 25+ years, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above who have completed primary education.\n97. Educational attainment, at least completed upper secondary, population 25+, female (%) (cumulative) (Numeric): The percentage of female population aged 25 and above who have completed upper secondary education.\n98. Educational attainment, at least completed upper secondary, population 25+, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above who have completed upper secondary education.\n99. Educational attainment, at least completed upper secondary, population 25+, total (%) (cumulative) (Numeric): The percentage of the total population aged 25 and above who have completed upper secondary education.\n100. Educational attainment, Doctoral or equivalent, population 25+, male (%) (cumulative) (Numeric): The percentage of male population aged 25 and above with a Doctoral or equivalent degree.\n101. Employers, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female employment in employers' roles.\n102. Employers, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male employment in employers' roles.\n103. Employment in agriculture, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male employment in the agriculture sector.\n104. Employment in industry, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female employment in the industry sector.\n105. Employment in industry, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male employment in the industry sector.\n106. Employment to population ratio, 15+, female (%) (modeled ILO estimate) (Numeric): The percentage of females aged 15 and above who are employed relative to the total population aged 15 and above.\n107. Employment to population ratio, 15+, male (%) (modeled ILO estimate) (Numeric): The percentage of males aged 15 and above who are employed relative to the total population aged 15 and above.\n108. Fertility rate, total (births per woman) (Numeric): The number of births per woman.\n109. Firms with female participation in ownership (% of firms) (Numeric): The percentage of firms with female participation in ownership.\n110. Labor force participation rate, female (% of female population ages 15+) (modeled ILO estimate) (Numeric): The percentage of females aged 15 and above who are part of the labor force.\n111. Labor force participation rate, male (% of male population ages 15+) (modeled ILO estimate) (Numeric): The percentage of males aged 15 and above who are part of the labor force.\n112. Labor force, female (% of total labor force) (Numeric): The percentage of the total labor force that is female.\n113. Life expectancy at birth, female (years) (Numeric): The average number of years a newborn female is expected to live.\n114. Lifetime risk of maternal death (%) (Numeric): The lifetime risk of maternal death for women.\n115. Literacy rate, youth female (% of females ages 15-24) (Numeric): The percentage of females aged 15-24 who can read and write.\n116. Maternal mortality ratio (modeled estimate, per 100,000 live births) (Numeric): The estimated maternal mortality ratio per 100,000 live births in a given country.\n117. Maternal mortality ratio (national estimate, per 100,000 live births) (Numeric): The national estimate of maternal mortality ratio per 100,000 live births.\n118. Mortality rate, adult, female (per 1,000 female adults) (Numeric): The mortality rate per 1,000 female adults.\n119. Mortality rate, adult, male (per 1,000 male adults) (Numeric): The mortality rate per 1,000 male adults.\n120. Net intake rate in grade 1, female (% of official school-age population) (Numeric): The percentage of official school-age girls enrolled in grade 1.\n121. Net intake rate in grade 1, male (% of official school-age population) (Numeric): The percentage of official school-age boys enrolled in grade 1.\n122. Part time employment, female (% of total female employment) (Numeric): The percentage of total female employment that is part-time.\n123. Part time employment, male (% of total male employment) (Numeric): The percentage of total male employment that is part-time.\n124. Persistence to grade 5, male (% of cohort) (Numeric): The percentage of boys who complete up to grade 5 out of the total cohort.\n125. Pregnant women receiving prenatal care (%) (Numeric): The percentage of pregnant women receiving prenatal care.\n126. Prevalence of current tobacco use, females (% of female adults) (Numeric): The percentage of female adults who currently use tobacco.\n127. Prevalence of HIV, female (% ages 15-24) (Numeric): The percentage of females aged 15-24 who have HIV.\n128. Prevalence of underweight, weight for age, male (% of children under 5) (Numeric): The percentage of boys under the age of 5 who are underweight.\n129. Primary completion rate, female (% of relevant age group) (Numeric): The percentage of girls who complete primary education out of the relevant age group.\n130. Primary completion rate, male (% of relevant age group) (Numeric): The percentage of boys who complete primary education out of the relevant age group.\n131. Primary education, pupils (% female) (Numeric): The percentage of pupils in primary education who are female.\n132. Progression to secondary school, male (%) (Numeric): The percentage of boys who progress to secondary school from primary school.\n133. Proportion of women subjected to physical and/or sexual violence in the last 12 months (% of ever-partnered women ages 15-49) (Numeric): The percentage of ever-partnered women aged 15-49 who have experienced physical and/or sexual violence in the last 12 months.\n134. Repeaters, primary, female (% of female enrollment) (Numeric): The percentage of girls who repeat a grade in primary school out of the total enrollment.\n135. Repeaters, primary, male (% of male enrollment) (Numeric): The percentage of boys who repeat a grade in primary school out of the total enrollment.\n136. School enrollment, preprimary, female (% gross) (Numeric): The percentage of girls enrolled in preprimary education relative to the total population of that age group.\n137. School enrollment, preprimary, male (% gross) (Numeric): The percentage of boys enrolled in preprimary education relative to the total population of that age group.\n138. School enrollment, primary (gross), gender parity index (GPI) (Numeric): The ratio of the gross enrollment rates between primary school for both genders.\n139. School enrollment, secondary (gross), gender parity index (GPI) (Numeric): The ratio of the gross enrollment rates between secondary school for both genders.\n140. School enrollment, secondary, male (% gross) (Numeric): The percentage of boys enrolled in secondary school relative to the total population of secondary school age.\n141. School enrollment, secondary, male (% net) (Numeric): The percentage of boys enrolled in secondary school relative to the total population of secondary school age, adjusted for repeaters and over-aged students.\n142. School enrollment, tertiary, female (% gross) (Numeric): The percentage of females enrolled in tertiary education relative to the total population of that age group.\n143. School enrollment, tertiary, male (% gross) (Numeric): The percentage of males enrolled in tertiary education relative to the total population of that age group.\n144. Secondary education, pupils (% female) (Numeric): The percentage of pupils in secondary education who are female.\n145. Secondary education, teachers (% female) (Numeric): The percentage of secondary school teachers who are female.\n146. Self-employed, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male workers who are self-employed.\n147. Survival to age 65, female (% of cohort) (Numeric): The percentage of females who survive until the age of 65 out of the total cohort.\n148. Trained teachers in primary education, female (% of female teachers) (Numeric): The percentage of trained primary education teachers who are female.\n149. Trained teachers in primary education, male (% of male teachers) (Numeric): The percentage of trained primary education teachers who are male.\n150. Unemployment, female (% of female labor force) (modeled ILO estimate) (Numeric): The percentage of unemployed females in the labor force.\n151. Unemployment, male (% of male labor force) (modeled ILO estimate) (Numeric): The percentage of unemployed males in the labor force.\n152. Wage and salaried workers, female (% of female employment) (modeled ILO estimate) (Numeric): The percentage of female employment in wage and salaried roles.\n153. Wage and salaried workers, male (% of male employment) (modeled ILO estimate) (Numeric): The percentage of male employment in wage and salaried roles.\n154. Women who believe a husband is justified in beating his wife (any of five reasons) (%) (Numeric): The percentage of women who believe a husband is justified in beating his wife due to any of five reasons.\n155. Women who believe a husband is justified in beating his wife when she argues with him (%) (Numeric): The percentage of women who believe a husband is justified in beating his wife when she argues with him.\n156. Women who believe a husband is justified in beating his wife when she refuses sex with him (%) (Numeric): The percentage of women who believe a husband is justified in beating his wife when she refuses sex with him.\n157. Women who were first married by age 15 (% of women ages 20-24) (Numeric): The percentage of women aged 20-24 who were married for the first time by the age of 15.\n158. Women who were first married by age 18 (% of women ages 20-24) (Numeric): The percentage of women aged 20-24 who were married for the first time by the age of 18.\n\nThese data attributes cover a wide range of topics including education, employment, health, violence against women, gender equality, and contraceptive use."
    },
    "Health.csv": {
        "name": "Health.csv",
        "description": "The dataset is named 'Health.csv' and it contains various attributes related to health indicators and population characteristics. The attributes in the dataset include:\n\n1. country_name (data type: string): The name of the country.\n2. date (data type: string): The date for which the data is recorded.\n3. Age dependency ratio, old (% of working-age population) (data type: float): The percentage of elderly population compared to the working-age population.\n4. Antiretroviral therapy coverage (% of people living with HIV) (data type: float): The percentage of people living with HIV who receive antiretroviral therapy.\n5. Antiretroviral therapy coverage for PMTCT (% of pregnant women living with HIV) (data type: float): The percentage of pregnant women living with HIV who receive antiretroviral therapy for prevention of mother-to-child transmission.\n6. Cause of death, by communicable diseases and maternal, prenatal and nutrition conditions (% of total) (data type: float): The percentage of deaths attributed to communicable diseases and related causes.\n7. Completeness of death registration with cause-of-death information (%) (data type: float): The percentage of death registrations with cause-of-death information.\n8. Contraceptive prevalence, any modern method (% of married women ages 15-49) (data type: float): The percentage of married women ages 15-49 using any modern contraceptive method.\n9. Current health expenditure per capita (current US$) (data type: float): The per capita current health expenditure in US dollars.\n10. Current health expenditure per capita, PPP (current international $) (data type: float): The per capita current health expenditure in purchasing power parity (PPP) international dollars.\n11. Domestic general government health expenditure (% of general government expenditure) (data type: float): The percentage of general government expenditure allocated to domestic general government health expenditure.\n12. Exclusive breastfeeding (% of children under 6 months) (data type: float): The percentage of children under 6 months who are exclusively breastfed.\n13. Female headed households (% of households with a female head) (data type: float): The percentage of households with a female head.\n14. Incidence of HIV, ages 15-24 (per 1,000 uninfected population ages 15-24) (data type: float): The incidence rate of new HIV infections among the population ages 15-24.\n15. Increase in poverty gap at $3.20 ($ 2011 PPP) poverty line due to out-of-pocket health care expenditure (% of poverty line) (float): The increase in the poverty gap at the $3.20 poverty line due to out-of-pocket health care expenditure.\n16. Life expectancy at birth, male (years) (data type: float): The average number of years a newborn male is expected to live.\n17. Lifetime risk of maternal death (1 in: rate varies by country) (data type: string): The lifetime risk of maternal death, expressed as the number of maternal deaths per live births.\n18. Mortality rate attributed to household and ambient air pollution, age-standardized (per 100,000 population) (data type: float): The age-standardized mortality rate attributed to household and ambient air pollution.\n19. Mortality rate, infant (per 1,000 live births) (data type: float): The number of infant deaths per 1,000 live births.\n20. Net migration (data type: float): The net migration rate, indicating the difference between the number of immigrants and emigrants per 1,000 population.\n21. Number of infant deaths (data type: float): The number of deaths among infants.\n22. Number of maternal deaths (data type: float): The number of deaths among mothers.\n23. Number of people pushed below the $3.65 ($ 2017 PPP) poverty line by out-of-pocket health care expenditure (data type: float): The number of people pushed below the $3.65 poverty line due to out-of-pocket health care expenditure.\n24. Number of under-five deaths (data type: float): The number of deaths among children under five years old.\n25. Out-of-pocket expenditure per capita (current US$) (data type: float): The per capita out-of-pocket health care expenditure in US dollars.\n26. Out-of-pocket expenditure per capita, PPP (current international $) (data type: float): The per capita out-of-pocket health care expenditure in PPP international dollars.\n27. People practicing open defecation, urban (% of urban population) (data type: float): The percentage of urban population practicing open defecation.\n28. People using at least basic drinking water services (% of population) (data type: float): The percentage of population using at least basic drinking water services.\n29. People using at least basic sanitation services, urban (% of urban population) (data type: float): The percentage of urban population using at least basic sanitation services.\n30. People using safely managed drinking water services, rural (% of rural population) (data type: float): The percentage of rural population using safely managed drinking water services.\n31. People using safely managed drinking water services, urban (% of urban population) (data type: float): The percentage of urban population using safely managed drinking water services.\n32. People with basic handwashing facilities including soap and water (% of population) (data type: float): The percentage of population with access to basic handwashing facilities including soap and water.\n33. Population ages 00-04, female (% of female population) (data type: float): The percentage of female population aged 00-04.\n34. Population ages 0-14, total (data type: float): The total population aged 0-14.\n35. Population ages 10-14, male (% of male population) (data type: float): The percentage of male population aged 10-14.\n36. Population ages 15-64 (% of total population) (data type: float): The percentage of total population aged 15-64.\n37. Population ages 15-64, female (% of female population) (data type: float): The percentage of female population aged 15-64.\n38. Population ages 20-24, female (% of female population) (data type: float): The percentage of female population aged 20-24.\n39. Population ages 40-44, male (% of male population) (data type: float): The percentage of male population aged 40-44.\n40. Population ages 45-49, female (% of female population) (data type: float): The percentage of female population aged 45-49.\n41. Mortality rate, infant, male (per 1,000 live births) (data type: float): The number of deaths among male infants per 1,000 live births.\n42. Mortality rate, under-5 (per 1,000 live births) (data type: float): The number of deaths among children under five years old per 1,000 live births.\n43. Net migration (data type: float): The net migration rate, indicating the difference between the number of immigrants and emigrants per 1,000 population.\n44. Number of infant deaths (data type: float): The number of deaths among infants.\n45. Number of maternal deaths (data type: float): The number of deaths among mothers.\n46. Number of people pushed below the $3.65 ($ 2017 PPP) poverty line by out-of-pocket health care expenditure (data type: float): The number of people pushed below the $3.65 poverty line due to out-of-pocket health care expenditure.\n47. Number of under-five deaths (data type: float): The number of deaths among children under five years old.\n48. Out-of-pocket expenditure per capita (current US$) (data type: float): The per capita out-of-pocket health care expenditure in US dollars.\n49. Out-of-pocket expenditure per capita, PPP (current international $) (data type: float): The per capita out-of-pocket health care expenditure in PPP international dollars.\n50. People practicing open defecation, urban (% of urban population) (data type: float): The percentage of urban population practicing open defecation.\n51. People using at least basic drinking water services (% of population) (data type: float): The percentage of population using at least basic drinking water services.\n52. People using at least basic sanitation services, urban (% of urban population) (data type: float): The percentage of urban population using at least basic sanitation services.\n53. People using safely managed drinking water services, rural (% of rural population) (data type: float): The percentage of rural population using safely managed drinking water services.\n54. People using safely managed drinking water services, urban (% of urban population) (data type: float): The percentage of urban population using safely managed drinking water services.\n55. People with basic handwashing facilities including soap and water (% of population) (data type: float): The percentage of population with access to basic handwashing facilities including soap and water.\n56. Population ages 00-04, female (% of female population) (data type: float): The percentage of female population aged 00-04.\n57. Population ages 0-14, total (data type: float): The total population aged 0-14.\n58. Population ages 10-14, male (% of male population) (data type: float): The percentage of male population aged 10-14.\n59. Population ages 15-64 (% of total population) (data type: float): The percentage of total population aged 15-64.\n60. Population ages 15-64, female (% of female population) (data type: float): The percentage of female population aged 15-64.\n61. Population ages 20-24, female (% of female population) (data type: float): The percentage of female population aged 20-24.\n62. Population ages 40-44, male (% of male population) (data type: float): The percentage of male population aged 40-44.\n63. Population ages 45-49, female (% of female population) (data type: float): The percentage of female population aged 45-49.\n64. Population ages 45-49, male (% of male population) (data type: float): The percentage of male population aged 45-49.\n65. Population ages 50-54, female (% of female population) (data type: float): The percentage of female population aged 50-54.\n66. Population ages 60-64, male (% of male population) (data type: float): The percentage of male population aged 60-64.\n67. Population ages 65 and above, male (data type: float): The total population aged 65 and above, male.\n68. Population ages 65-69, male (% of male population) (data type: float): The percentage of male population aged 65-69.\n69. Population ages 80 and above, male (% of male population) (data type: float): The percentage of male population aged 80 and above.\n70. Population, female (data type: float): The total female population.\n71. Prevalence of current tobacco use, males (% of male adults) (data type: float): The percentage of male adults who currently use tobacco.\n72. Prevalence of wasting, weight for height (% of children under 5) (data type: float): The percentage of children under 5 who have low weight for their height indicating wasting.\n73. Proportion of population spending more than 10% of household consumption or income on out-of-pocket health care expenditure (%) (data type: float): The percentage of population spending more than 10% of household consumption or income on out-of-pocket health care expenditure.\n74. Proportion of population spending more than 25% of household consumption or income on out-of-pocket health care expenditure (%) (data type: float): The percentage of population spending more than 25% of household consumption or income on out-of-pocket health care expenditure.\n75. Refugee population by country or territory of origin (data type: string): The number of refugees by their country or territory of origin.\n76. Risk of catastrophic expenditure for surgical care (% of people at risk) (data type: float): The percentage of people at risk of experiencing catastrophic expenditure for surgical care.\n77. Sex ratio at birth (male births per female births) (data type: float): The ratio of male births to female births.\n78. Specialist surgical workforce (per 100,000 population) (data type: float): The number of specialist surgical workforce per 100,000 population.\n79. Suicide mortality rate (per 100,000 population) (data type: float): The mortality rate due to suicide per 100,000 population.\n80. Survival to age 65, male (% of cohort) (data type: float): The percentage of males who survive to the age of 65.\n81. Total alcohol consumption per capita, female (liters of pure alcohol, projected estimates, female 15+ years of age) (data type: float): The per capita total alcohol consumption for females aged 15 and above in liters of pure alcohol.\n82. Total alcohol consumption per capita, male (liters of pure alcohol, projected estimates, male 15+ years of age) (data type: float): The per capita total alcohol consumption for males aged 15 and above in liters of pure alcohol.\n83. Tuberculosis treatment success rate (% of new cases) (data type: float): The percentage of new tuberculosis cases that successfully completed treatment.\n84. Unmet need for contraception (% of married women ages 15-49) (data type: float): The percentage of married women aged 15-49 with an unmet need for contraception.\n85. Women who believe a husband is justified in beating his wife when she goes out without telling him (%) (data type: float): The percentage of women who believe a husband is justified in beating his wife when she goes out without telling him.\n86. Young people (ages 15-24) newly infected with HIV (data type: float): The number of young people aged 15-24 who are newly infected with HIV.\n87. Adults (ages 15+) and children (ages 0-14) newly infected with HIV (data type: float): The number of adults aged 15 and above and children aged 0-14 who are newly infected with HIV.\n88. Age dependency ratio, young (% of working-age population) (data type: float): The percentage of young population compared to the working-age population.\n89. ARI treatment (% of children under 5 taken to a health provider) (data type: float): The percentage of children under 5 taken to a health provider for acute respiratory infection treatment.\n90. Births attended by skilled health staff (% of total) (data type: float): The percentage of births attended by skilled health staff out of the total number of births.\n91. Children (0-14) living with HIV (data type: float): The number of children aged 0-14 living with HIV.\n92. Completeness of birth registration, female (%) (data type: float): The percentage of birth registrations that are complete for females.\n93. Completeness of birth registration, rural (%) (data type: float): The percentage of birth registrations that are complete in rural areas.\n94. Condom use, population ages 15-24, male (% of males ages 15-24) (data type: float): The percentage of males aged 15-24 who use condoms.\n95. Death rate, crude (per 1,000 people) (data type: float): The crude death rate per 1,000 population.\n96. Diabetes prevalence (% of population ages 20 to 79) (data type: float): The percentage of the population aged 20 to 79 with diabetes.\n97. Diarrhea treatment (% of children under 5 receiving oral rehydration and continued feeding) (data type: float): The percentage of children under 5 who receive oral rehydration and continued feeding for diarrhea treatment.\n98. Domestic private health expenditure (% of current health expenditure) (data type: float): The percentage of current health expenditure funded by domestic private sources.\n99. External health expenditure (% of current health expenditure) (data type: float): The percentage of current health expenditure funded by external sources.\n100. External health expenditure per capita, PPP (current international $) (data type: float): The per capita external health expenditure in PPP international dollars.\n101. Immunization, measles (% of children ages 12-23 months) (data type: float): The percentage of children ages 12-23 months vaccinated against measles.\n102. Incidence of tuberculosis (per 100,000 people) (data type: float): The incidence rate of tuberculosis per 100,000 population.\n103. Life expectancy at birth, total (years) (data type: float): The average number of years a newborn is expected to live.\n104. Mortality from CVD, cancer, diabetes or CRD between exact ages 30 and 70 (%) (data type: float): The percentage of deaths attributed to cardiovascular diseases, cancer, diabetes, or chronic respiratory diseases between exact ages 30 and 70.\n105. Mortality rate attributed to unintentional poisoning, male (per 100,000 male population) (data type: float): The mortality rate attributed to unintentional poisoning among the male population per 100,000 population.\n106. Mortality rate, under-5, male (per 1,000 live births) (data type: float): The number of deaths among male children under five years old per 1,000 live births.\n107. Newborns protected against tetanus (%) (data type: float): The percentage of newborns protected against tetanus.\n108. Number of people spending more than 10% of household consumption or income on out-of-pocket health care expenditure (data type: float): The number of people spending more than 10% of household consumption or income on out-of-pocket health care expenditure.\n109. Nurses and midwives (per 1,000 people) (data type: float): The number of nurses and midwives per 1,000 population.\n110. People practicing open defecation (% of population) (data type: float): The percentage of population practicing open defecation.\n111. People using at least basic drinking water services, urban (% of urban population) (data type: float): The percentage of urban population using at least basic drinking water services.\n112. People using safely managed sanitation services, urban (% of urban population) (data type: float): The percentage of urban population using safely managed sanitation services.\n113. People with basic handwashing facilities including soap and water, urban (% of urban population) (data type: float): The percentage of urban population with access to basic handwashing facilities including soap and water.\n114. Physicians (per 1,000 people) (data type: float): The number of physicians per 1,000 population.\n115. Population ages 00-04, male (% of male population) (data type: float): The percentage of male population aged 00-04.\n116. Population ages 0-14 (% of total population) (data type: float): The percentage of total population aged 0-14.\n117. Population ages 0-14, female (% of female population) (data type: float): The percentage of female population aged 0-14.\n118. Population ages 0-14, male (data type: float): The total male population aged 0-14.\n119. Population ages 05-09, female (% of female population) (data type: float): The percentage of female population aged 05-09.\n120. Population ages 15-19, female (% of female population) (data type: float): The percentage of female population aged 15-19.\n121. Population ages 15-64, male (% of male population) (data type: float): The percentage of male population aged 15-64.\n122. Population ages 15-64, total (data type: float): The total population aged 15-64.\n123. Population ages 25-29, male (% of male population) (data type: float): The percentage of male population aged 25-29.\n124. Population ages 35-39, female (% of female population) (data type: float): The percentage of female population aged 35-39.\n125. Population ages 75-79, male (% of male population) (data type: float): The percentage of male population aged 75-79.\n126. Population ages 80 and above, female (% of female population) (data type: float): The percentage of female population aged 80 and above.\n127. Population growth (annual %) (data type: float): The annual population growth rate.\n128. Population, total (data type: float): The total population.\n129. Prevalence of anemia among women of reproductive age (% of women ages 15-49) (data type: float): The percentage of women ages 15-49 with anemia.\n130. Prevalence of HIV, male (% ages 15-24) (data type: float): The percentage of males aged 15-24 with HIV.\n131. Prevalence of moderate or severe food insecurity in the population (%) (data type: float): The percentage of the population experiencing moderate or severe food insecurity.\n132. Prevalence of overweight (modeled estimate, % of children under 5) (data type: float): The percentage of children under 5 who are overweight.\n133. Prevalence of stunting, height for age, female (% of children under 5) (data type: float): The percentage of female children under 5 with stunted growth.\n134. Prevalence of stunting, height for age, male (% of children under 5) (data type: float): The percentage of male children under 5 with stunted growth.\n135. Prevalence of underweight, weight for age, female (% of children under 5) (data type: float): The percentage of female children under 5 who are underweight for their age.\n136. Prevalence of wasting, weight for height, female (% of children under 5) (data type: float): The percentage of female children under 5 who have low weight for their height indicating wasting.\n137. Prevalence of wasting, weight for height, male (% of children under 5) (data type: float): The percentage of male children under 5 who have low weight for their height indicating wasting.\n138. Teenage mothers (% of women ages 15-19 who have had children or are currently pregnant) (data type: float): The percentage of women ages 15-19 who have had children or are currently pregnant.\n139. Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age) (data type: float): The per capita total alcohol consumption in liters of pure alcohol for individuals aged 15 and above.\n140. UHC service coverage index (data type: float): The Universal Health Coverage service coverage index.\n141. Use of insecticide-treated bed nets (% of under-5 population) (data type: float): The percentage of children under 5 using insecticide-treated bed nets for malaria prevention.\n142. Vitamin A supplementation coverage rate (% of children ages 6-59 months) (data type: float): The percentage of children aged 6-59 months receiving vitamin A supplementation.\n143. Wanted fertility rate (births per woman) (data type: float): The desired number of births per woman.\n144. Women who believe a husband is justified in beating his wife when she burns the food (%) (data type: float): The percentage of women who believe a husband is justified in beating his wife when she burns the food.\n145. Women who believe a husband is justified in beating his wife when she neglects the children (%) (data type: float): The percentage of women who believe a husband is justified in beating his wife when she neglects the children.\n146. Women who were first married by age 15 (% of women ages 20-24) (data type: float): The percentage of women aged 20-24 who were first married by age 15.\n147. Women's share of population ages 15+ living with HIV (%) (data type: float): The percentage of the population ages 15 and above living with HIV that is female.\n148. Adolescent fertility rate (births per 1,000 women ages 15-19) (data type: float): The number of births per 1,000 women aged 15-19.\n149. Adults (ages 15-49) newly infected with HIV (data type: float): The number of adults aged 15-49 who are newly infected with HIV.\n150. Age dependency ratio (% of working-age population) (data type: float): The percentage of the working-age population dependent on the younger and older populations.\n151. Cause of death, by non-communicable diseases (% of total) (data type: float): The percentage of deaths attributed to non-communicable diseases.\n152. Children (ages 0-14) newly infected with HIV (data type: float): The number of children aged 0-14 who are newly infected with HIV.\n153. Children with fever receiving antimalarial drugs (% of children under age 5 with fever) (data type: float): The percentage of children under 5 with fever who receive antimalarial drugs.\n154. Completeness of birth registration (%) (data type: float): The percentage of birth registrations that are complete.\n155. Completeness of birth registration, urban (%) (data type: float): The percentage of birth registrations that are complete in urban areas.\n156. Current health expenditure (% of GDP) (data type: float): The percentage of GDP spent on current health expenditure.\n157. Demand for family planning satisfied by modern methods (% of married women with demand for family planning) (data type: float): The percentage of married women with demand for family planning who have their demand satisfied by modern methods.\n158. Domestic general government health expenditure (% of current health expenditure) (data type: float): The percentage of current health expenditure funded by domestic general government sources.\n159. Domestic general government health expenditure (% of GDP) (data type: float): The percentage of GDP allocated to domestic general government health expenditure.\n160. Domestic general government health expenditure per capita (current US$) (data type: float): The per capita domestic general government health expenditure in current US dollars.\n161. Domestic general government health expenditure per capita, PPP (current international $) (data type: float): The per capita domestic general government health expenditure in PPP international dollars.\n162. Domestic private health expenditure per capita, PPP (current international $) (data type: float): The per capita domestic private health expenditure in PPP international dollars.\n163. Female genital mutilation prevalence (%) (data type: float): The percentage of females who have undergone female genital mutilation.\n164. Immunization, HepB3 (% of one-year-old children) (data type: float): The percentage of one-year-old children vaccinated against Hepatitis B.\n165. Incidence of HIV, all (per 1,000 uninfected population) (data type: float): The incidence rate of new HIV infections among the entire population.\n166. Incidence of malaria (per 1,000 population at risk) (data type: float): The incidence rate of malaria among the population at risk.\n167. Increase in poverty gap at $1.90 ($ 2011 PPP) poverty line due to out-of-pocket health care expenditure (USD) (data type: float): The increase in the poverty gap at the $1.90 poverty line due to out-of-pocket health care expenditure in US dollars.\n168. International migrant stock (% of population) (data type: float): The percentage of the population composed of international migrants.\n169. Life expectancy at birth, female (years) (data type: float): The average number of years a newborn female is expected to live.\n170. Lifetime risk of maternal death (%) (data type: float): The lifetime risk of maternal death, expressed as a percentage.\n171. Low-birthweight babies (% of births) (data type: float): The percentage of babies born with low birth weight.\n172. Mortality rate attributed to unintentional poisoning (per 100,000 population) (data type: float): The mortality rate attributed to unintentional poisoning per 100,000 population.\n173. Mortality rate attributed to unsafe water, unsafe sanitation and lack of hygiene (per 100,000 population) (data type: float): The mortality rate attributed to unsafe water, unsafe sanitation, and lack of hygiene per 100,000 population.\n174. Mortality rate, infant, female (per 1,000 live births) (data type: float): The number of deaths among female infants per 1,000 live births.\n175. Number of people spending more than 25% of household consumption or income on out-of-pocket health care expenditure (data type: float): The number of people spending more than 25% of household consumption or income on out-of-pocket health care expenditure.\n176. Number of surgical procedures (per 100,000 population) (data type: float): The number of surgical procedures per 100,000 population.\n177. People practicing open defecation, rural (% of rural population) (data type: float): The percentage of rural population practicing open defecation.\n178. People using at least basic sanitation services (% of population) (data type: float): The percentage of population using at least basic sanitation services.\n179. People using safely managed drinking water services (% of population) (data type: float): The percentage of population using safely managed drinking water services.\n180. People using safely managed sanitation services, rural (% of rural population) (data type: float): The percentage of rural population using safely managed sanitation services.\n181. People with basic handwashing facilities including soap and water, rural (% of rural population) (data type: float): The percentage of rural population with access to basic handwashing facilities including soap and water.\n182. Population ages 0-14, female (data type: float): The total female population aged 0-14.\n183. Population ages 10-14, female (% of female population) (data type: float): The percentage of female population aged 10-14.\n184. Population ages 15-64, female (data type: float): The total female population aged 15-64.\n185. Population ages 20-24, male (% of male population) (data type: float): The percentage of male population aged 20-24.\n186. Population ages 25-29, female (% of female population) (data type: float): The percentage of female population aged 25-29.\n187. Population ages 30-34, female (% of female population) (data type: float): The percentage of female population aged 30-34.\n188. Population ages 30-34, male (% of male population) (data type: float): The percentage of male population aged 30-34.\n189. Population ages 50-54, male (% of male population) (data type: float): The percentage of male population aged 50-54.\n190. Population ages 55-59, male (% of male population) (data type: float): The percentage of male population aged 55-59.\n191. Population ages 65 and above, male (% of male population) (data type: float): The percentage of male population aged 65 and above.\n192. Population ages 65 and above, total (data type: float): The total population aged 65 and above.\n193. Population ages 65-69, female (% of female population) (data type: float): The percentage of female population aged 65-69.\n194. Population ages 70-74, female (% of female population) (data type: float): The percentage of female population aged 70-74.\n195. Population, female (% of total population) (data type: float): The percentage of total population that is female.\n196. Population, male (% of total population) (data type: float): The percentage of total population that is male.\n197. Prevalence of anemia among pregnant women (%) (data type: float): The percentage of pregnant women with anemia.\n198. Prevalence of current tobacco use (% of adults) (data type: float): The percentage of adults who currently use tobacco.\n199. Prevalence of current tobacco use, females (% of female adults) (data type: float): The percentage of female adults who currently use tobacco.\n200. Prevalence of HIV, female (% ages 15-24) (data type: float): The percentage of females aged 15-24 with HIV.\n201. Prevalence of overweight, weight for height, male (% of children under 5) (data type: float): The percentage of male children under 5 who are overweight for their height.\n202. Prevalence of severe wasting, weight for height (% of children under 5) (data type: float): The percentage of children under 5 who have severe wasting (very low weight for their height).\n203. Prevalence of stunting, height for age (% of children under 5) (data type: float): The percentage of children under 5 with stunted growth.\n204. Prevalence of stunting, height for age (modeled estimate, % of children under 5) (data type: float): The percentage of children under 5 with stunted growth based on modeled estimates.\n205. Prevalence of undernourishment (% of population) (data type: float): The percentage of the population that is undernourished.\n206. Proportion of population pushed below the $2.15 ($ 2017 PPP) poverty line by out-of-pocket health care expenditure (%) (data type: float): The percentage of population pushed below the $2.15 poverty line due to out-of-pocket health care expenditure.\n207. Refugee population by country or territory of asylum (data type: string): The number of refugees by their country or territory of asylum.\n208. Suicide mortality rate, female (per 100,000 female population) (data type: float): The mortality rate due to suicide among the female population per 100,000 population.\n209. Tuberculosis case detection rate (%, all forms) (data type: float): The percentage of all tuberculosis cases detected.\n210. Women who believe a husband is justified in beating his wife (any of five reasons) (%) (data type: float): The percentage of women who believe a husband is justified in beating his wife for any of five specified reasons.\n211. Women who believe a husband is justified in beating his wife when she argues with him (%) (data type: float): The percentage of women who believe a husband is justified in beating his wife when she argues with him.\n212. Birth rate, crude (per 1,000 people) (data type: float): The crude birth rate per 1,000 population.\n213. Cause of death, by injury (% of total) (data type: float): The percentage of deaths attributed to injury.\n214. Community health workers (per 1,000 people) (data type: float): The number of community health workers per 1,000 population.\n215. Completeness of birth registration, male (%) (data type: float): The percentage of birth registrations that are complete for males.\n216. Condom use, population ages 15-24, female (% of females ages 15-24) (data type: float): The percentage of females aged 15-24 who use condoms.\n217. Consumption of iodized salt (% of households) (data type: float): The percentage of households consuming iodized salt."
    },
    "Infrastructure.csv": {
        "name": "Infrastructure.csv",
        "description": "The dataset is named \"Infrastructure.csv\" and it contains data related to various infrastructure indicators. The dataset has a total of 44 attributes. \n\nThe attributes in the dataset include:\n1. country_name: The name of the country\n2. date: The date of the recorded data entry\n3. Air transport, freight (million ton-km): The amount of freight transported by air in million ton-kilometers\n4. Air transport, passengers carried: The number of passengers carried by air transport\n5. Air transport, registered carrier departures worldwide: The number of departures by registered carriers worldwide\n6. Annual freshwater withdrawals, agriculture (% of total freshwater withdrawal): The percentage of annual freshwater withdrawals dedicated to agriculture\n7. Annual freshwater withdrawals, domestic (% of total freshwater withdrawal): The percentage of annual freshwater withdrawals for domestic use\n8. Annual freshwater withdrawals, industry (% of total freshwater withdrawal): The percentage of annual freshwater withdrawals for industrial use\n9. Annual freshwater withdrawals, total (% of internal resources): The percentage of annual freshwater withdrawals relative to the internal resources \n10. Annual freshwater withdrawals, total (billion cubic meters): The total annual freshwater withdrawals in billion cubic meters\n11. Container port traffic (TEU: 20-foot equivalent units): The amount of traffic in container ports measured in TEUs\n12. Electric power consumption (kWh per capita): The electricity consumption per capita in kilowatt-hours\n13. Electric power transmission and distribution losses (% of output): The percentage of losses during the transmission and distribution of electric power\n14. Electricity production from coal sources (% of total): The percentage of electricity production from coal sources relative to the total electricity production\n15. Electricity production from hydroelectric sources (% of total): The percentage of electricity production from hydroelectric sources relative to the total electricity production\n16. Electricity production from natural gas sources (% of total): The percentage of electricity production from natural gas sources relative to the total electricity production\n17. Electricity production from nuclear sources (% of total): The percentage of electricity production from nuclear sources relative to the total electricity production\n18. Electricity production from oil sources (% of total): The percentage of electricity production from oil sources relative to the total electricity production\n19. Fixed broadband subscriptions: The number of fixed broadband subscriptions\n20. Fixed broadband subscriptions (per 100 people): The number of fixed broadband subscriptions per 100 people\n21. Fixed telephone subscriptions: The number of fixed telephone subscriptions\n22. Fixed telephone subscriptions (per 100 people): The number of fixed telephone subscriptions per 100 people\n23. ICT goods exports (% of total goods exports): The percentage of ICT goods exports relative to the total goods exports\n24. ICT goods imports (% total goods imports): The percentage of ICT goods imports relative to the total goods imports\n25. ICT service exports (% of service exports, BoP): The percentage of ICT service exports relative to the total service exports (balance of payments)\n26. ICT service exports (BoP, current US$): The value of ICT service exports in current US dollars (balance of payments)\n27. Individuals using the Internet (% of population): The percentage of individuals using the Internet relative to the population\n28. Industrial design applications, nonresident, by count: The number of industrial design applications by nonresidents\n29. Industrial design applications, resident, by count: The number of industrial design applications by residents\n30. Investment in energy with private participation (current US$): The investment in energy sector with private participation in current US dollars\n31. Investment in ICT with private participation (current US$): The investment in ICT sector with private participation in current US dollars\n32. Investment in transport with private participation (current US$): The investment in transport sector with private participation in current US dollars\n33. Investment in water and sanitation with private participation (current US$): The investment in water and sanitation sector with private participation in current US dollars\n34. Liner shipping connectivity index (maximum value in 2004 = 100): The liner shipping connectivity index representing the connectivity of ports (with a maximum value of 100 in 2004)\n35. Mobile cellular subscriptions: The number of mobile cellular subscriptions\n36. Mobile cellular subscriptions (per 100 people): The number of mobile cellular subscriptions per 100 people\n37. Public private partnerships investment in energy (current US$): The investment in energy sector through public-private partnerships in current US dollars\n38. Public private partnerships investment in ICT (current US$): The investment in ICT sector through public-private partnerships in current US dollars\n39. Public private partnerships investment in transport (current US$): The investment in transport sector through public-private partnerships in current US dollars\n40. Public private partnerships investment in water and sanitation (current US$): The investment in water and sanitation sector through public-private partnerships in current US dollars\n41. Rail lines (total route-km): The total length of rail lines in route kilometers\n42. Railways, goods transported (million ton-km): The amount of goods transported by railways in million ton-kilometers\n43. Railways, passengers carried (million passenger-km): The number of passengers carried by railways in million passenger-kilometers\n44. Renewable internal freshwater resources per capita (cubic meters): The amount of renewable internal freshwater resources per capita in cubic meters\n45. Renewable internal freshwater resources, total (billion cubic meters): The total amount of renewable internal freshwater resources in billion cubic meters\n46. Secure Internet servers: The number of secure Internet servers\n47. Secure Internet servers (per 1 million people): The number of secure Internet servers per 1 million people\n48. Trademark applications, nonresident, by count: The number of trademark applications by nonresidents\n49. Trademark applications, resident, by count: The number of trademark applications by residents\n\nThe dataset provides a wide range of infrastructure-related information, including transportation (air transport and railways), freshwater withdrawals, electricity production and consumption, broadband and telephone subscriptions, internet usage, investment in various sectors, and trademark applications. The data types of the attributes may vary but can include strings, dates, percentages, counts, and numerical values in various units such as tons, kilometers, cubic meters, or dollars."
    },
    "Millenium development goals.csv": {
        "name": "Millenium development goals.csv",
        "description": "The dataset is named \"Millenium development goals.csv\" and it appears to contain information related to the Millennium Development Goals. The dataset has the following attributes:\n\n1. country_name: This attribute represents the name of the country for which the data is recorded. It is of type string and provides identification for the country.\n\n2. date: This attribute represents the date for which the data is recorded. It could be the year or a specific date. The data type is not specified.\n\n3. Net ODA provided to the least developed countries (% of GNI): This attribute represents the Net Official Development Assistance (ODA) provided to the least developed countries as a percentage of Gross National Income (GNI). It is a measure of the financial aid provided by donor countries to support development in the least developed countries. The data type is not specified.\n\n4. Net ODA provided, to the least developed countries (current US$): This attribute represents the Net ODA provided to the least developed countries in current US dollars. It is a measure of the monetary value of the aid provided by donor countries. The data type is not specified.\n\n5. Net ODA provided, total (% of GNI): This attribute represents the Net ODA provided to all countries as a percentage of GNI. It encompasses aid provided to both least developed and other countries. The data type is not specified.\n\n6. Net ODA provided, total (constant 2020 US$): This attribute represents the Net ODA provided to all countries in constant 2020 US dollars. It is a measure of the monetary value of the aid provided, adjusted for inflation. The data type is not specified.\n\n7. Net ODA provided, total (current US$): This attribute represents the Net ODA provided to all countries in current US dollars. It is a measure of the monetary value of the aid provided without adjusting for inflation. The data type is not specified.\n\nOverall, the dataset appears to contain information about the Net Official Development Assistance provided by donor countries to support the Millennium Development Goals, including specific details about aid provided to least developed countries."
    },
    "Poverty.csv": {
        "name": "Poverty.csv",
        "description": "The dataset is named \"Poverty.csv\" and it contains information related to poverty indicators. The dataset includes the following attributes:\n\n1. country_name: The name of the country (data type: string).\n2. date: The date for which the data is reported (data type: string).\n3. Annualized average growth rate in per capita real survey mean consumption or income, bottom 40% of population (%): The annualized average growth rate in per capita real survey mean consumption or income for the bottom 40% of the population (data type: float).\n4. Annualized average growth rate in per capita real survey mean consumption or income, total population (%): The annualized average growth rate in per capita real survey mean consumption or income for the total population (data type: float).\n5. Gini index: The measure of income inequality, specifically the Gini coefficient (data type: float).\n6. Income share held by fourth 20%: The share of income held by the fourth 20% of the population (data type: float).\n7. Income share held by highest 10%: The share of income held by the top 10% of the population (data type: float).\n8. Income share held by highest 20%: The share of income held by the top 20% of the population (data type: float).\n9. Income share held by lowest 10%: The share of income held by the bottom 10% of the population (data type: float).\n10. Income share held by lowest 20%: The share of income held by the bottom 20% of the population (data type: float).\n11. Income share held by second 20%: The share of income held by the second 20% of the population (data type: float).\n12. Income share held by third 20%: The share of income held by the third 20% of the population (data type: float).\n13. Multidimensional poverty headcount ratio (% of total population): The percentage of the total population living in multidimensional poverty (data type: float).\n14. Multidimensional poverty headcount ratio, children (% of population ages 0-17): The percentage of children (ages 0-17) living in multidimensional poverty (data type: float).\n15. Multidimensional poverty headcount ratio, female (% of female population): The percentage of females living in multidimensional poverty (data type: float).\n16. Multidimensional poverty headcount ratio, household (% of total households): The percentage of households living in multidimensional poverty (data type: float).\n17. Multidimensional poverty headcount ratio, male (% of male population): The percentage of males living in multidimensional poverty (data type: float).\n18. Multidimensional poverty index (scale 0-1): The index measuring the extent of multidimensional poverty on a scale from 0 to 1 (data type: float).\n19. Multidimensional poverty index, children (population ages 0-17) (scale 0-1): The index measuring the extent of multidimensional poverty among children (ages 0-17) on a scale from 0 to 1 (data type: float).\n20. Multidimensional poverty intensity (average share of deprivations experienced by the poor): The average share of deprivations experienced by individuals living in multidimensional poverty (data type: float).\n21. Population living in slums (% of urban population): The percentage of the urban population living in slums (data type: float).\n22. Poverty gap at $2.15 a day (2017 PPP) (%): The poverty gap at $2.15 a day (2017 purchasing power parity) as a percentage of the population (data type: float).\n23. Poverty gap at $3.65 a day (2017 PPP) (%): The poverty gap at $3.65 a day (2017 purchasing power parity) as a percentage of the population (data type: float).\n24. Poverty gap at $6.85 a day (2017 PPP) (%): The poverty gap at $6.85 a day (2017 purchasing power parity) as a percentage of the population (data type: float).\n25. Poverty headcount ratio at $2.15 a day (2017 PPP) (% of population): The percentage of the population living below the poverty line of $2.15 a day (2017 purchasing power parity) (data type: float).\n26. Poverty headcount ratio at $3.65 a day (2017 PPP) (% of population): The percentage of the population living below the poverty line of $3.65 a day (2017 purchasing power parity) (data type: float).\n27. Poverty headcount ratio at $6.85 a day (2017 PPP) (% of population): The percentage of the population living below the poverty line of $6.85 a day (2017 purchasing power parity) (data type: float).\n28. Poverty headcount ratio at national poverty lines (% of population): The percentage of the population living below the national poverty line (data type: float).\n29. Proportion of people living below 50 percent of median income (%): The proportion of people living below 50% of the median income (data type: float).\n30. Survey mean consumption or income per capita, bottom 40% of population (2017 PPP $ per day): The mean consumption or income per capita for the bottom 40% of the population in 2017 purchasing power parity dollars per day (data type: float).\n31. Survey mean consumption or income per capita, total population (2017 PPP $ per day): The mean consumption or income per capita for the total population in 2017 purchasing power parity dollars per day (data type: float)."
    },
    "Private Sector.csv": {
        "name": "Private Sector.csv",
        "description": "The dataset is named \"Private Sector.csv\". It contains various attributes that provide information about different aspects of the private sector in different countries. The attributes include the following:\n\n1. country_name: The name of the country.\n2. date: The date of the data.\n3. Agricultural raw materials imports (% of merchandise imports): The percentage of agricultural raw materials imports compared to total merchandise imports.\n4. Binding coverage, all products (%): The percentage of products subject to binding coverage.\n5. Bound rate, simple mean, all products (%): The simple mean of bound rates for all products.\n6. Bound rate, simple mean, manufactured products (%): The simple mean of bound rates for manufactured products.\n7. Business extent of disclosure index (0=less disclosure to 10=more disclosure): A measure of the extent of business disclosure, ranging from 0 to 10.\n8. Computer, communications and other services (% of commercial service exports): The percentage of commercial service exports accounted for by computer, communications, and other services.\n9. Cost to export, border compliance (US$): The cost of exporting goods, including border compliance costs, in US dollars.\n10. Depth of credit information index (0=low to 8=high): A measure of the availability and depth of credit information, ranging from 0 to 8.\n11. Ease of doing business rank (1=most business-friendly regulations): The country's rank in terms of the ease of doing business, with 1 being the most business-friendly.\n12. Firms that do not report all sales for tax purposes (% of firms): The percentage of firms that do not report all sales for tax purposes.\n13. Firms using banks to finance working capital (% of firms): The percentage of firms that use banks to finance their working capital.\n14. Firms with female top manager (% of firms): The percentage of firms that have a female top manager.\n15. Food exports (% of merchandise exports): The percentage of merchandise exports accounted for by food.\n16. Food imports (% of merchandise imports): The percentage of merchandise imports accounted for by food.\n17. Import value index (2000 = 100): An index that measures the value of imports relative to the year 2000.\n18. Logistics performance index: Competence and quality of logistics services (1=low to 5=high): A measure of the competence and quality of logistics services, ranging from 1 to 5.\n19. Logistics performance index: Efficiency of customs clearance process (1=low to 5=high): A measure of the efficiency of the customs clearance process, ranging from 1 to 5.\n20. Manufactures exports (% of merchandise exports): The percentage of merchandise exports accounted for by manufactures.\n21. Manufactures imports (% of merchandise imports): The percentage of merchandise imports accounted for by manufactures.\n22. Merchandise exports to high-income economies (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to high-income economies.\n23. Merchandise exports to low- and middle-income economies in East Asia & Pacific (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies in East Asia and Pacific.\n24. Merchandise exports to low- and middle-income economies in Europe & Central Asia (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies in Europe and Central Asia.\n25. Merchandise exports to low- and middle-income economies in South Asia (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies in South Asia.\n26. Merchandise exports to low- and middle-income economies in Sub-Saharan Africa (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies in Sub-Saharan Africa.\n27. Merchandise exports to low- and middle-income economies outside region (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies outside the specific region.\n28. Merchandise imports from low- and middle-income economies in Middle East & North Africa (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies in the Middle East and North Africa.\n29. Merchandise imports from low- and middle-income economies in South Asia (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies in South Asia.\n30. Merchandise imports from low- and middle-income economies within region (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies within the specific region.\n31. Number of visits or required meetings with tax officials (average for affected firms): The average number of visits or required meetings with tax officials for affected firms.\n32. Ores and metals exports (% of merchandise exports): The percentage of merchandise exports accounted for by ores and metals.\n33. Ores and metals imports (% of merchandise imports): The percentage of merchandise imports accounted for by ores and metals.\n34. Procedures to register property (number): The number of procedures required to register property.\n35. Share of tariff lines with international peaks, all products (%): The percentage of tariff lines with international peaks for all products.\n36. Strength of legal rights index (0=weak to 12=strong): A measure of the strength of legal rights, ranging from 0 to 12.\n37. Tariff rate, applied, weighted mean, manufactured products (%): The weighted mean of applied tariff rates for manufactured products.\n38. Tariff rate, applied, weighted mean, primary products (%): The weighted mean of applied tariff rates for primary products.\n39. Time required to start a business (days): The time required to start a business in days.\n40. Time required to start a business, male (days): The time required for males to start a business in days.\n41. Time to export, border compliance (hours): The time required for exporting goods, including border compliance, in hours.\n42. Time to import, border compliance (hours): The time required for importing goods, including border compliance, in hours.\n43. Total tax and contribution rate (% of profit): The total tax and contribution rate as a percentage of profit.\n44. Trade in services (% of GDP): The percentage of GDP accounted for by trade in services.\n45. Transport services (% of commercial service imports): The percentage of commercial service imports accounted for by transport services.\n46. Binding coverage, primary products (%): The percentage of primary products subject to binding coverage.\n47. Commercial service imports (current US$): The value of commercial service imports in current US dollars.\n48. Cost of business start-up procedures, female (% of GNI per capita): The cost of business start-up procedures as a percentage of GNI per capita for females.\n49. Firms competing against unregistered firms (% of firms): The percentage of firms competing against unregistered firms.\n50. Firms formally registered when operations started (% of firms): The percentage of firms that are formally registered when their operations started.\n51. Firms that spend on R&D (% of firms): The percentage of firms that spend on research and development.\n52. Firms using banks to finance investment (% of firms): The percentage of firms that use banks to finance their investment.\n53. Firms visited or required meetings with tax officials (% of firms): The percentage of firms that have been visited or had required meetings with tax officials.\n54. ICT goods exports (% of total goods exports): The percentage of total goods exports accounted for by ICT goods.\n55. ICT goods imports (% total goods imports): The percentage of total goods imports accounted for by ICT goods.\n56. Import volume index (2000 = 100): An index that measures the volume of imports relative to the year 2000.\n57. Insurance and financial services (% of commercial service exports): The percentage of commercial service exports accounted for by insurance and financial services.\n58. Insurance and financial services (% of commercial service imports): The percentage of commercial service imports accounted for by insurance and financial services.\n59. Insurance and financial services (% of service exports, BoP): The percentage of service exports accounted for by insurance and financial services based on the Balance of Payments.\n60. International tourism, expenditures (% of total imports): The percentage of total imports accounted for by international tourism expenditures.\n61. International tourism, expenditures for passenger transport items (current US$): The expenditures on passenger transport items for international tourism in current US dollars.\n62. Investment in water and sanitation with private participation (current US$): The investment in water and sanitation with private participation in current US dollars.\n63. Lead time to export, median case (days): The median lead time for exporting goods in days.\n64. Logistics performance index: Ease of arranging competitively priced shipments (1=low to 5=high): A measure of the ease of arranging competitively priced shipments, ranging from 1 to 5.\n65. Logistics performance index: Quality of trade and transport-related infrastructure (1=low to 5=high): A measure of the quality of trade and transport-related infrastructure, ranging from 1 to 5.\n66. Losses due to theft and vandalism (% of annual sales of affected firms): The percentage of annual sales lost due to theft and vandalism for affected firms.\n67. Merchandise exports to economies in the Arab World (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to economies in the Arab World.\n68. Merchandise exports to low- and middle-income economies within region (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies within the specific region.\n69. Merchandise imports (current US$): The value of merchandise imports in current US dollars.\n70. Merchandise imports from high-income economies (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from high-income economies.\n71. Merchandise imports from low- and middle-income economies in Latin America & the Caribbean (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies in Latin America and the Caribbean.\n72. Merchandise imports from low- and middle-income economies in Sub-Saharan Africa (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies in Sub-Saharan Africa.\n73. New businesses registered (number): The number of new businesses registered.\n74. Private credit bureau coverage (% of adults): The percentage of adults covered by private credit bureaus.\n75. Share of tariff lines with international peaks, primary products (%): The percentage of tariff lines with international peaks for primary products.\n76. Share of tariff lines with specific rates, manufactured products (%): The percentage of tariff lines with specific rates for manufactured products.\n77. Start-up procedures to register a business, male (number): The number of start-up procedures required to register a business for males.\n78. Tariff rate, applied, simple mean, manufactured products (%): The simple mean of applied tariff rates for manufactured products.\n79. Tariff rate, applied, simple mean, primary products (%): The simple mean of applied tariff rates for primary products.\n80. Tariff rate, most favored nation, simple mean, all products (%): The simple mean of most favored nation tariff rates for all products.\n81. Tariff rate, most favored nation, weighted mean, all products (%): The weighted mean of most favored nation tariff rates for all products.\n82. Time required to build a warehouse (days): The time required to build a warehouse in days.\n83. Time required to register property (days): The time required to register property in days.\n84. Time required to start a business, female (days): The time required for females to start a business in days.\n85. Time spent dealing with the requirements of government regulations (% of senior management time): The percentage of senior management time spent dealing with the requirements of government regulations.\n86. Time to import, documentary compliance (hours): The time required for importing goods, including documentary compliance, in hours.\n87. Time to resolve insolvency (years): The time required to resolve insolvency in years.\n88. Binding coverage, manufactured products (%): The percentage of manufactured products subject to binding coverage.\n89. Bound rate, simple mean, primary products (%): The simple mean of bound rates for primary products.\n90. Bribery incidence (% of firms experiencing at least one bribe payment request): The percentage of firms that have experienced at least one bribe payment request.\n91. Commercial service exports (current US$): The value of commercial service exports in current US dollars.\n92. Cost of business start-up procedures, male (% of GNI per capita): The cost of business start-up procedures as a percentage of GNI per capita for males.\n93. Cost to export, documentary compliance (US$): The cost of exporting goods, including documentary compliance costs, in US dollars.\n94. Ease of doing business score (0=lowest performance to 100=best performance): A score that measures the ease of doing business, ranging from 0 to 100.\n95. Export unit value index (2015 = 100): An index that measures the unit value of exports relative to the year 2015.\n96. Export volume index (2000 = 100): An index that measures the volume of exports relative to the year 2000.\n97. Firms expected to give gifts in meetings with tax officials (% of firms): The percentage of firms expected to give gifts in meetings with tax officials.\n98. Firms experiencing electrical outages (% of firms): The percentage of firms that experience electrical outages.\n99. High-technology exports (% of manufactured exports): The percentage of manufactured exports accounted for by high-technology products.\n100. Import unit value index (2015 = 100): An index that measures the unit value of imports relative to the year 2015.\n101. Insurance and financial services (% of service imports, BoP): The percentage of service imports accounted for by insurance and financial services based on the Balance of Payments.\n102. International tourism, expenditures (current US$): The expenditures on international tourism in current US dollars.\n103. International tourism, expenditures for travel items (current US$): The expenditures on travel items for international tourism in current US dollars.\n104. International tourism, number of departures: The number of departures for international tourism.\n105. International tourism, receipts (% of total exports): The percentage of total exports accounted for by international tourism receipts.\n106. International tourism, receipts for passenger transport items (current US$): The receipts for passenger transport items for international tourism in current US dollars.\n107. Investment in transport with private participation (current US$): The investment in transport with private participation in current US dollars.\n108. Labor tax and contributions (% of commercial profits): The percentage of commercial profits accounted for by labor tax and contributions.\n109. Lead time to import, median case (days): The median lead time for importing goods in days.\n110. Logistics performance index: Ability to track and trace consignments (1=low to 5=high): A measure of the ability to track and trace consignments, ranging from 1 to 5.\n111. Logistics performance index: Frequency with which shipments reach consignee within scheduled or expected time (1=low to 5=high): A measure of the frequency with which shipments reach the consignee within the scheduled or expected time, ranging from 1 to 5.\n112. Merchandise exports (current US$): The value of merchandise exports in current US dollars.\n113. Merchandise exports by the reporting economy, residual (% of total merchandise exports): The percentage of total merchandise exports accounted for by the reporting economy's exports.\n114. Merchandise exports to low- and middle-income economies in Middle East & North Africa (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies in the Middle East and North Africa.\n115. Merchandise imports by the reporting economy, residual (% of total merchandise imports): The percentage of total merchandise imports accounted for by the reporting economy's imports.\n116. Merchandise imports from low- and middle-income economies in Europe & Central Asia (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies in Europe and Central Asia.\n117. Merchandise trade (% of GDP): The percentage of GDP accounted for by merchandise trade.\n118. New business density (new registrations per 1,000 people ages 15-64): The density of new business registrations per 1,000 people aged 15-64.\n119. Other taxes payable by businesses (% of commercial profits): The percentage of commercial profits accounted for by other taxes payable by businesses.\n120. Procedures to build a warehouse (number): The number of procedures required to build a warehouse.\n121. Profit tax (% of commercial profits): The percentage of commercial profits accounted for by profit tax.\n122. Share of tariff lines with international peaks, manufactured products (%): The percentage of tariff lines with international peaks for manufactured products.\n123. Share of tariff lines with specific rates, all products (%): The percentage of tariff lines with specific rates for all products.\n124. Start-up procedures to register a business (number): The number of start-up procedures required to register a business.\n125. Tariff rate, applied, simple mean, all products (%): The simple mean of applied tariff rates for all products.\n126. Tariff rate, most favored nation, simple mean, manufactured products (%): The simple mean of most favored nation tariff rates for manufactured products.\n127. Tariff rate, most favored nation, weighted mean, manufactured products (%): The weighted mean of most favored nation tariff rates for manufactured products.\n128. Time required to get electricity (days): The time required to get electricity in days.\n129. Time to export, documentary compliance (hours): The time required for exporting goods, including documentary compliance, in hours.\n130. Value lost due to electrical outages (% of sales for affected firms): The percentage of sales lost due to electrical outages for affected firms.\n131. Agricultural raw materials exports (% of merchandise exports): The percentage of merchandise exports accounted for by agricultural raw materials.\n132. Average time to clear exports through customs (days): The average time taken to clear exports through customs in days.\n133. Computer, communications and other services (% of commercial service imports): The percentage of commercial service imports accounted for by computer, communications, and other services.\n134. Cost of business start-up procedures (% of GNI per capita): The cost of business start-up procedures as a percentage of GNI per capita.\n135. Cost to import, border compliance (US$): The cost of importing goods, including border compliance costs, in US dollars.\n136. Cost to import, documentary compliance (US$): The cost of importing goods, including documentary compliance costs, in US dollars.\n137. Domestic credit to private sector (% of GDP): The percentage of GDP accounted for by domestic credit to the private sector.\n138. Export value index (2000 = 100): An index that measures the value of exports relative to the year 2000.\n139. Firms experiencing losses due to theft and vandalism (% of firms): The percentage of firms that experience losses due to theft and vandalism.\n140. Firms offering formal training (% of firms): The percentage of firms that offer formal training.\n141. Firms with female participation in ownership (% of firms): The percentage of firms with female participation in ownership.\n142. Fuel exports (% of merchandise exports): The percentage of merchandise exports accounted for by fuel.\n143. Fuel imports (% of merchandise imports): The percentage of merchandise imports accounted for by fuel.\n144. High-technology exports (current US$): The value of high-technology exports in current US dollars.\n145. Informal payments to public officials (% of firms): The percentage of firms that make informal payments to public officials.\n146. International tourism, number of arrivals: The number of arrivals for international tourism.\n147. International tourism, receipts (current US$): The receipts for international tourism in current US dollars.\n148. International tourism, receipts for travel items (current US$): The receipts for travel items for international tourism in current US dollars.\n149. Investment in energy with private participation (current US$): The investment in energy with private participation in current US dollars.\n150. Logistics performance index: Overall (1=low to 5=high): An overall measure of logistics performance, ranging from 1 to 5.\n151. Medium and high-tech exports (% manufactured exports): The percentage of manufactured exports accounted for by medium and high-tech products.\n152. Merchandise exports by the reporting economy (current US$): The value of merchandise exports by the reporting economy in current US dollars.\n153. Merchandise exports to low- and middle-income economies in Latin America & the Caribbean (% of total merchandise exports): The percentage of total merchandise exports accounted for by exports to low- and middle-income economies in Latin America and the Caribbean.\n154. Merchandise imports by the reporting economy (current US$): The value of merchandise imports by the reporting economy in current US dollars.\n155. Merchandise imports from economies in the Arab World (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from economies in the Arab World.\n156. Merchandise imports from low- and middle-income economies in East Asia & Pacific (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies in East Asia and Pacific.\n157. Merchandise imports from low- and middle-income economies outside region (% of total merchandise imports): The percentage of total merchandise imports accounted for by imports from low- and middle-income economies outside the specific region.\n158. Net barter terms of trade index (2000 = 100): An index that measures the net barter terms of trade relative to the year 2000.\n159. Power outages in firms in a typical month (number): The number of power outages experienced by firms in a typical month.\n160. Public credit registry coverage (% of adults): The percentage of adults covered by the public credit registry.\n161. Share of tariff lines with specific rates, primary products (%): The percentage of tariff lines with specific rates for primary products.\n162. Start-up procedures to register a business, female (number): The number of start-up procedures required to register a business for females.\n163. Tariff rate, applied, weighted mean, all products (%): The weighted mean of applied tariff rates for all products.\n164. Tariff rate, most favored nation, simple mean, primary products (%): The simple mean of most favored nation tariff rates for primary products.\n165. Tariff rate, most favored nation, weighted mean, primary products (%): The weighted mean of most favored nation tariff rates for primary products.\n166. Tax payments (number): The number of tax payments required.\n167. Time required to enforce a contract (days): The time required to enforce a contract in days.\n168. Time required to obtain an operating license (days): The time required to obtain an operating license in days.\n169. Time to obtain an electrical connection (days): The time required to obtain an electrical connection in days.\n170. Time to prepare and pay taxes (hours): The time required to prepare and pay taxes in hours.\n171. Transport services (% of commercial service exports): The percentage of commercial service exports accounted for by transport services.\n172. Travel services (% of commercial service exports): The percentage of commercial service exports accounted for by travel services.\n173. Travel services (% of commercial service imports): The percentage of commercial service imports accounted for by travel services."
    },
    "Public Sector.csv": {
        "name": "Public Sector.csv",
        "description": "The dataset \"Public Sector.csv\" contains data related to various aspects of the public sector. The dataset includes the following attributes:\n\n1. country_name: Name of the country (String)\n2. date: Date of the data entry (Date)\n3. Arms exports (SIPRI trend indicator values): Indicator value for arms exports (Numeric)\n4. Arms imports (SIPRI trend indicator values): Indicator value for arms imports (Numeric)\n5. Central government debt, total (current LCU): Total amount of central government debt in the country (Numeric)\n6. CPIA business regulatory environment rating (1=low to 6=high): Rating of business regulatory environment on a scale of 1 to 6 (Numeric)\n7. CPIA economic management cluster average (1=low to 6=high): Average rating of economic management cluster on a scale of 1 to 6 (Numeric)\n8. CPIA equity of public resource use rating (1=low to 6=high): Rating of equity of public resource use on a scale of 1 to 6 (Numeric)\n9. CPIA financial sector rating (1=low to 6=high): Rating of financial sector on a scale of 1 to 6 (Numeric)\n10. CPIA fiscal policy rating (1=low to 6=high): Rating of fiscal policy on a scale of 1 to 6 (Numeric)\n11. CPIA gender equality rating (1=low to 6=high): Rating of gender equality on a scale of 1 to 6 (Numeric)\n12. CPIA policy and institutions for environmental sustainability rating (1=low to 6=high): Rating of policy and institutions for environmental sustainability on a scale of 1 to 6 (Numeric)\n13. CPIA property rights and rule-based governance rating (1=low to 6=high): Rating of property rights and rule-based governance on a scale of 1 to 6 (Numeric)\n14. CPIA quality of public administration rating (1=low to 6=high): Rating of quality of public administration on a scale of 1 to 6 (Numeric)\n15. CPIA trade rating (1=low to 6=high): Rating of trade policies on a scale of 1 to 6 (Numeric)\n16. Customs and other import duties (% of tax revenue): Percentage of tax revenue from customs and import duties (Numeric)\n17. Customs and other import duties (current LCU): Current local currency unit value of customs and import duties (Numeric)\n18. Expense (% of GDP): Percentage of GDP spent on expenses (Numeric)\n19. Expense (current LCU): Current local currency unit value of expenses (Numeric)\n20. Goods and services expense (% of expense): Percentage of expense on goods and services (Numeric)\n21. Grants and other revenue (% of revenue): Percentage of revenue from grants and other sources (Numeric)\n22. Human Capital Index (HCI), Lower Bound (scale 0-1): Lower bound of a scale from 0 to 1 representing the Human Capital Index (Numeric)\n23. Human Capital Index (HCI), Male (scale 0-1): Human Capital Index score for males on a scale from 0 to 1 (Numeric)\n24. Human Capital Index (HCI), Male, Upper Bound (scale 0-1): Upper bound of a scale from 0 to 1 representing the Human Capital Index for males (Numeric)\n25. Human Capital Index (HCI), Upper Bound (scale 0-1): Upper bound of a scale from 0 to 1 representing the Human Capital Index (Numeric)\n26. IDA resource allocation index (1=low to 6=high): Index representing the allocation of resources by IDA on a scale from 1 to 6 (Numeric)\n27. Intentional homicides (per 100,000 people): Number of intentional homicides per 100,000 people (Numeric)\n28. Interest payments (% of revenue): Percentage of revenue spent on interest payments (Numeric)\n29. Internally displaced persons, new displacement associated with conflict and violence (number of cases): Number of cases of new displacement associated with conflict and violence (Numeric)\n30. Internally displaced persons, new displacement associated with disasters (number of cases): Number of cases of new displacement associated with disasters (Numeric)\n31. Internally displaced persons, total displaced by conflict and violence (number of people): Total number of people displaced by conflict and violence (Numeric)\n32. Military expenditure (% of GDP): Percentage of GDP spent on military expenditure (Numeric)\n33. Military expenditure (% of general government expenditure): Percentage of general government expenditure spent on military (Numeric)\n34. Military expenditure (current USD): Current US dollar value of military expenditure (Numeric)\n35. Net investment in nonfinancial assets (% of GDP): Percentage of GDP invested in nonfinancial assets (Numeric)\n36. Net investment in nonfinancial assets (current LCU): Current local currency unit value of investment in nonfinancial assets (Numeric)\n37. Other expense (current LCU): Current local currency unit value of other expenses (Numeric)\n38. Other taxes (current LCU): Current local currency unit value of other taxes (Numeric)\n39. Proportion of seats held by women in national parliaments (%): Percentage of seats in national parliaments held by women (Numeric)\n40. Revenue, excluding grants (% of GDP): Percentage of GDP from revenue excluding grants (Numeric)\n41. Revenue, excluding grants (current LCU): Current local currency unit value of revenue excluding grants (Numeric)\n42. Social contributions (current LCU): Current local currency unit value of social contributions (Numeric)\n43. Statistical Capacity Score (Overall Average) (scale 0 - 100): Overall average score representing statistical capacity on a scale from 0 to 100 (Numeric)\n44. Statistical performance indicators (SPI): Pillar 2 data services score (scale 0-100): Score representing the quality of data services in Pillar 2 of statistical performance indicators on a scale from 0 to 100 (Numeric)\n45. Statistical performance indicators (SPI): Pillar 4 data sources score (scale 0-100): Score representing the quality of data sources in Pillar 4 of statistical performance indicators on a scale from 0 to 100 (Numeric)\n46. Strength of legal rights index (0=weak to 12=strong): Index representing the strength of legal rights on a scale from 0 to 12 (Numeric)\n47. Subsidies and other transfers (% of expense): Percentage of expenses allocated as subsidies and other transfers (Numeric)\n48. Subsidies and other transfers (current LCU): Current local currency unit value of subsidies and other transfers (Numeric)\n49. Tax revenue (% of GDP): Percentage of GDP from tax revenue (Numeric)\n50. Taxes on income, profits and capital gains (% of revenue): Percentage of revenue from taxes on income, profits, and capital gains (Numeric)\n51. Taxes on income, profits and capital gains (% of total taxes): Percentage of total taxes from taxes on income, profits, and capital gains (Numeric)\n52. Taxes on income, profits and capital gains (current LCU): Current local currency unit value of taxes on income, profits, and capital gains (Numeric)\n53. Taxes on international trade (current LCU): Current local currency unit value of taxes on international trade (Numeric)\n54. Total tax and contribution rate (% of profit): Percentage of profit allocated as total tax and contribution rate (Numeric)\n55. Armed forces personnel (% of total labor force): Percentage of total labor force comprising armed forces personnel (Numeric)\n56. Armed forces personnel, total: Total number of armed forces personnel (Numeric)\n57. Battle-related deaths (number of people): Number of people who died in battle-related incidents (Numeric)\n58. Central government debt, total (% of GDP): Percentage of GDP representing total central government debt (Numeric)\n59. Compensation of employees (% of expense): Percentage of expense allocated as compensation of employees (Numeric)\n60. Compensation of employees (current LCU): Current local currency unit value of compensation of employees (Numeric)\n61. CPIA building human resources rating (1=low to 6=high): Rating of building human resources on a scale of 1 to 6 (Numeric)\n62. CPIA debt policy rating (1=low to 6=high): Rating of debt policy on a scale of 1 to 6 (Numeric)\n63. CPIA efficiency of revenue mobilization rating (1=low to 6=high): Rating of efficiency of revenue mobilization on a scale of 1 to 6 (Numeric)\n64. CPIA macroeconomic management rating (1=low to 6=high): Rating of macroeconomic management on a scale of 1 to 6 (Numeric)\n65. CPIA policies for social inclusion/equity cluster average (1=low to 6=high): Average rating of policies for social inclusion/equity cluster on a scale of 1 to 6 (Numeric)\n66. CPIA public sector management and institutions cluster average (1=low to 6=high): Average rating of public sector management and institutions cluster on a scale of 1 to 6 (Numeric)\n67. CPIA quality of budgetary and financial management rating (1=low to 6=high): Rating of quality of budgetary and financial management on a scale of 1 to 6 (Numeric)\n68. CPIA social protection rating (1=low to 6=high): Rating of social protection on a scale of 1 to 6 (Numeric)\n69. CPIA structural policies cluster average (1=low to 6=high): Average rating of structural policies cluster on a scale of 1 to 6 (Numeric)\n70. CPIA transparency, accountability, and corruption in the public sector rating (1=low to 6=high): Rating of transparency, accountability, and corruption in the public sector on a scale of 1 to 6 (Numeric)\n71. Goods and services expense (current LCU): Current local currency unit value of goods and services expense (Numeric)\n72. Grants and other revenue (current LCU): Current local currency unit value of grants and other revenue (Numeric)\n73. Human Capital Index (HCI) (scale 0-1): Human Capital Index score on a scale from 0 to 1 (Numeric)\n74. Human Capital Index (HCI), Female (scale 0-1): Human Capital Index score for females on a scale from 0 to 1 (Numeric)\n75. Human Capital Index (HCI), Female, Lower Bound (scale 0-1): Lower bound of a scale from 0 to 1 representing the Human Capital Index for females (Numeric)\n76. Human Capital Index (HCI), Female, Upper Bound (scale 0-1): Upper bound of a scale from 0 to 1 representing the Human Capital Index for females (Numeric)\n77. Human Capital Index (HCI), Male, Lower Bound (scale 0-1): Lower bound of a scale from 0 to 1 representing the Human Capital Index for males (Numeric)\n78. Intentional homicides, female (per 100,000 female): Number of intentional homicides per 100,000 females (Numeric)\n79. Intentional homicides, male (per 100,000 male): Number of intentional homicides per 100,000 males (Numeric)\n80. Interest payments (% of expense): Percentage of expenses allocated to interest payments (Numeric)\n81. Interest payments (current LCU): Current local currency unit value of interest payments (Numeric)\n82. Methodology assessment of statistical capacity (scale 0 - 100): Assessment score of statistical capacity methodology on a scale from 0 to 100 (Numeric)\n83. Military expenditure (current LCU): Current local currency unit value of military expenditure (Numeric)\n84. Net acquisition of financial assets (% of GDP): Percentage of GDP representing net acquisition of financial assets (Numeric)\n85. Net acquisition of financial assets (current LCU): Current local currency unit value of net acquisition of financial assets (Numeric)\n86. Net incurrence of liabilities, total (% of GDP): Percentage of GDP representing net incurrence of liabilities (Numeric)\n87. Net incurrence of liabilities, total (current LCU): Current local currency unit value of net incurrence of liabilities (Numeric)\n88. Net lending (+) / net borrowing (-) (% of GDP): Percentage of GDP representing net lending or borrowing (Numeric)\n89. Net lending (+) / net borrowing (-) (current LCU): Current local currency unit value of net lending or borrowing (Numeric)\n90. Other expense (% of expense): Percentage of expenses allocated as other expenses (Numeric)\n91. Other taxes (% of revenue): Percentage of revenue from other taxes (Numeric)\n92. Periodicity and timeliness assessment of statistical capacity (scale 0 - 100): Assessment score of statistical capacity periodicity and timeliness on a scale from 0 to 100 (Numeric)\n93. Primary government expenditures as a proportion of original approved budget (%): Percentage of original approved budget allocated as primary government expenditures (Numeric)\n94. Public credit registry coverage (% of adults): Percentage of adults covered by public credit registry (Numeric)\n95. Social contributions (% of revenue): Percentage of revenue from social contributions (Numeric)\n96. Source data assessment of statistical capacity (scale 0 - 100): Assessment score of statistical capacity source data on a scale from 0 to 100 (Numeric)\n97. Statistical performance indicators (SPI): Overall score (scale 0-100): Overall score representing statistical performance indicators on a scale from 0 to 100 (Numeric)\n98. Statistical performance indicators (SPI): Pillar 1 data use score (scale 0-100): Score representing the quality of data use in Pillar 1 of statistical performance indicators on a scale from 0 to 100 (Numeric)\n99. Statistical performance indicators (SPI): Pillar 3 data products score (scale 0-100): Score representing the quality of data products in Pillar 3 of statistical performance indicators on a scale from 0 to 100 (Numeric)\n100. Statistical performance indicators (SPI): Pillar 5 data infrastructure score (scale 0-100): Score representing the quality of data infrastructure in Pillar 5 of statistical performance indicators on a scale from 0 to 100 (Numeric)\n101. Tax payments (number): Number of tax payments (Numeric)\n102. Tax revenue (current LCU): Current local currency unit value of tax revenue (Numeric)\n103. Taxes on exports (% of tax revenue): Percentage of tax revenue from taxes on exports (Numeric)\n104. Taxes on exports (current LCU): Current local currency unit value of taxes on exports (Numeric)\n105. Taxes on goods and services (% of revenue): Percentage of revenue from taxes on goods and services (Numeric)\n106. Taxes on goods and services (% value added of industry and services): Percentage of value added in industry and services from taxes on goods and services (Numeric)\n107. Taxes on goods and services (current LCU): Current local currency unit value of taxes on goods and services (Numeric)\n108. Taxes on international trade (% of revenue): Percentage of revenue from taxes on international trade (Numeric)\n109. Time to prepare and pay taxes (hours): Number of hours required to prepare and pay taxes (Numeric)"
    },
    "Science & Technology.csv": {
        "name": "Science & Technology.csv",
        "description": "The dataset \"Science & Technology.csv\" contains information related to various aspects of science and technology. The dataset includes the following attributes:\n\n1. country_name: a string representing the name of the country.\n2. date: the date or time period for which the data is recorded.\n3. Charges for the use of intellectual property, payments (BoP, current US$): a numerical value representing the amount of money spent on intellectual property payments in current US dollars.\n4. Charges for the use of intellectual property, receipts (BoP, current US$): a numerical value representing the amount of money received from intellectual property payments in current US dollars.\n5. High-technology exports (% of manufactured exports): a numerical value representing the percentage of high-technology exports in relation to total manufactured exports.\n6. High-technology exports (current US$): a numerical value representing the amount of money generated from high-technology exports in current US dollars.\n7. Patent applications, nonresidents: a numerical value representing the number of patent applications filed by nonresidents.\n8. Patent applications, residents: a numerical value representing the number of patent applications filed by residents.\n9. Research and development expenditure (% of GDP): a numerical value representing the percentage of a country's gross domestic product spent on research and development.\n10. Researchers in R&D (per million people): a numerical value representing the number of researchers engaged in research and development per million people.\n11. Scientific and technical journal articles: a numerical value representing the number of scientific and technical journal articles published.\n12. Technicians in R&D (per million people): a numerical value representing the number of technicians involved in research and development per million people.\n\nThese attributes provide insights into various aspects of a country's science and technology sector, including intellectual property usage, high-technology exports, patent applications, research and development expenditure, researchers, scientific publications, and technicians."
    },
    "Social Development.csv": {
        "name": "Social Development.csv",
        "description": "The dataset is about social development and it contains various attributes related to different aspects of social development. \n\nThe data attributes and their data types are as follows:\n\n1. country_name: String - It represents the name of the country.\n2. date: String - It represents the date for which the data is recorded.\n3. Adolescent fertility rate (births per 1,000 women ages 15-19): Numeric - It represents the number of births per 1,000 women aged 15-19.\n4. Children in employment, female (% of female children ages 7-14): Numeric - It represents the percentage of female children aged 7-14 who are involved in employment.\n5. Children in employment, male (% of male children ages 7-14): Numeric - It represents the percentage of male children aged 7-14 who are involved in employment.\n6. Children in employment, study and work (% of children in employment, ages 7-14): Numeric - It represents the percentage of children aged 7-14 who are involved in both study and work.\n7. Children in employment, study and work, female (% of female children in employment, ages 7-14): Numeric - It represents the percentage of female children in employment aged 7-14 who are involved in both study and work.\n8. Children in employment, study and work, male (% of male children in employment, ages 7-14): Numeric - It represents the percentage of male children in employment aged 7-14 who are involved in both study and work.\n9. Children in employment, total (% of children ages 7-14): Numeric - It represents the percentage of children aged 7-14 who are involved in employment.\n10. Children in employment, work only (% of children in employment, ages 7-14): Numeric - It represents the percentage of children aged 7-14 who are involved only in work.\n11. Children in employment, work only, female (% of female children in employment, ages 7-14): Numeric - It represents the percentage of female children in employment aged 7-14 who are involved only in work.\n12. Children in employment, work only, male (% of male children in employment, ages 7-14): Numeric - It represents the percentage of male children in employment aged 7-14 who are involved only in work.\n13. Labor force participation rate for ages 15-24, female (%) (modeled ILO estimate): Numeric - It represents the percentage of females aged 15-24 who are participating in the labor force.\n14. Labor force participation rate for ages 15-24, male (%) (modeled ILO estimate): Numeric - It represents the percentage of males aged 15-24 who are participating in the labor force.\n15. Labor force participation rate for ages 15-24, total (%) (modeled ILO estimate): Numeric - It represents the total percentage of people aged 15-24 who are participating in the labor force.\n16. Labor force participation rate, female (% of female population ages 15+) (modeled ILO estimate): Numeric - It represents the percentage of females aged 15 and above who are participating in the labor force.\n17. Labor force participation rate, female (% of female population ages 15-64) (modeled ILO estimate): Numeric - It represents the percentage of females aged 15-64 who are participating in the labor force.\n18. Labor force participation rate, male (% of male population ages 15+) (modeled ILO estimate): Numeric - It represents the percentage of males aged 15 and above who are participating in the labor force.\n19. Labor force participation rate, male (% of male population ages 15-64) (modeled ILO estimate): Numeric - It represents the percentage of males aged 15-64 who are participating in the labor force.\n20. Labor force participation rate, total (% of total population ages 15-64) (modeled ILO estimate): Numeric - It represents the total percentage of the population aged 15-64 who are participating in the labor force.\n21. Life expectancy at birth, female (years): Numeric - It represents the average number of years a female is expected to live at birth.\n22. Life expectancy at birth, male (years): Numeric - It represents the average number of years a male is expected to live at birth.\n23. Literacy rate, youth (ages 15-24), gender parity index (GPI): Numeric - It represents the gender parity index of the youth literacy rate between ages 15-24.\n24. Prevalence of HIV, female (% ages 15-24): Numeric - It represents the percentage of females aged 15-24 who are HIV positive.\n25. Prevalence of HIV, male (% ages 15-24): Numeric - It represents the percentage of males aged 15-24 who are HIV positive.\n26. Proportion of seats held by women in national parliaments (%): Numeric - It represents the percentage of seats in national parliaments held by women.\n27. Refugee population by country or territory of asylum: String - It represents the country or territory where refugees seek asylum.\n28. Refugee population by country or territory of origin: String - It represents the country or territory from where refugees originate.\n29. School enrollment, primary (gross), gender parity index (GPI): Numeric - It represents the gender parity index of primary school enrollment.\n30. School enrollment, primary and secondary (gross), gender parity index (GPI): Numeric - It represents the gender parity index of combined primary and secondary school enrollment.\n31. School enrollment, secondary (gross), gender parity index (GPI): Numeric - It represents the gender parity index of secondary school enrollment.\n32. School enrollment, tertiary (gross), gender parity index (GPI): Numeric - It represents the gender parity index of tertiary school enrollment.\n33. Unemployment, female (% of female labor force) (modeled ILO estimate): Numeric - It represents the percentage of unemployed females in the female labor force.\n34. Unemployment, male (% of male labor force) (modeled ILO estimate): Numeric - It represents the percentage of unemployed males in the male labor force.\n35. Vulnerable employment, female (% of female employment) (modeled ILO estimate): Numeric - It represents the percentage of females in vulnerable employment.\n36. Vulnerable employment, male (% of male employment) (modeled ILO estimate): Numeric - It represents the percentage of males in vulnerable employment.\n\nOverall, the dataset provides information on various social development indicators such as labor force participation, education, health, and employment for different countries and time periods."
    },
    "Social Protection & Labor.csv": {
        "name": "Social Protection & Labor.csv",
        "description": "The dataset is titled \"Social Protection & Labor.csv\" and contains attributes related to social protection and labor programs in various countries. \n\nThe data attributes include:\n1. country_name (data type: string): The name of the country.\n2. date (data type: string): The date of the data.\n3. Adequacy of social insurance programs (% of total welfare of beneficiary households) (data type: float): This attribute represents the adequacy of social insurance programs as a percentage of the total welfare of beneficiary households.\n4. Adequacy of social safety net programs (% of total welfare of beneficiary households) (data type: float): This attribute represents the adequacy of social safety net programs as a percentage of the total welfare of beneficiary households.\n5. Adequacy of unemployment benefits and ALMP (% of total welfare of beneficiary households) (data type: float): This attribute represents the adequacy of unemployment benefits and Active Labor Market Programs (ALMP) as a percentage of the total welfare of beneficiary households.\n6. Average working hours of children, working only, ages 7-14 (hours per week) (data type: float): This attribute represents the average number of working hours per week for children aged 7-14 who are engaged in work.\n7. Benefit incidence of social protection and labor programs to poorest quintile (% of total SPL benefits) (data type: float): This attribute represents the benefit incidence of social protection and labor programs to the poorest quintile as a percentage of the total benefits received.\n8. Child employment in manufacturing, male (% of male economically active children ages 7-14) (data type: float): This attribute represents the percentage of male economically active children aged 7-14 who are employed in the manufacturing sector.\n9. Children in employment, female (% of female children ages 7-14) (data type: float): This attribute represents the percentage of female children aged 7-14 who are employed.\n10. Children in employment, male (% of male children ages 7-14) (data type: float): This attribute represents the percentage of male children aged 7-14 who are employed.\n11. Children in employment, self-employed, female (% of female children in employment, ages 7-14) (data type: float): This attribute represents the percentage of female children in employment aged 7-14 who are self-employed.\n12. Children in employment, unpaid family workers, female (% of female children in employment, ages 7-14) (data type: float): This attribute represents the percentage of female children in employment aged 7-14 who are unpaid family workers.\n13. Children in employment, unpaid family workers, male (% of male children in employment, ages 7-14) (data type: float): This attribute represents the percentage of male children in employment aged 7-14 who are unpaid family workers.\n\nThe description of the remaining attributes continues similarly, including information about employment, labor force participation, unemployment, and coverage of social protection programs."
    },
    "Trade.csv": {
        "name": "Trade.csv",
        "description": "The dataset is called \"Trade.csv\" and it contains information about various trade-related indicators for different countries. The dataset includes the following attributes:\n\n1. country_name: The name of the country.\n\n2. date: The date for which the trade data is reported.\n\n3. Agricultural raw materials imports (% of merchandise imports): The percentage of agricultural raw materials imports out of total merchandise imports.\n\n4. Arms exports (SIPRI trend indicator values): The trend indicator values for arms exports.\n\n5. Arms imports (SIPRI trend indicator values): The trend indicator values for arms imports.\n\n6. Binding coverage, all products (%): The percentage of products with binding coverage.\n\n7. Binding coverage, primary products (%): The percentage of primary products with binding coverage.\n\n8. Bound rate, simple mean, all products (%): The simple mean bound rate for all products.\n\n9. Bound rate, simple mean, manufactured products (%): The simple mean bound rate for manufactured products.\n\n10. Commercial service imports (current US$): The value of commercial service imports in current US dollars.\n\n11. Communications, computer, etc. (% of service imports, BoP): The percentage of service imports related to communication and computer services.\n\n12. Computer, communications and other services (% of commercial service exports): The percentage of commercial service exports related to computer, communications, and other services.\n\n13. Cost to export, border compliance (US$): The cost in US dollars for exporting goods, related to border compliance.\n\n14. Customs and other import duties (% of tax revenue): The percentage of tax revenue related to customs and other import duties.\n\n15. Exports of goods and services (current US$): The value of goods and services exported in current US dollars.\n\n16. Exports of goods, services and primary income (BoP, current US$): The value of goods, services, and primary income exported in current US dollars.\n\n17. External balance on goods and services (% of GDP): The percentage of GDP represented by the external balance on goods and services.\n\n18. Food exports (% of merchandise exports): The percentage of merchandise exports represented by food exports.\n\n19. Food imports (% of merchandise imports): The percentage of merchandise imports represented by food imports.\n\n20. Goods exports (BoP, current US$): The value of goods exported in balance of payments (BoP) current US dollars.\n\n21. Goods imports (BoP, current US$): The value of goods imported in balance of payments (BoP) current US dollars.\n\n22. ICT goods exports (% of total goods exports): The percentage of total goods exports represented by information and communication technology (ICT) goods exports.\n\n23. ICT goods imports (% total goods imports): The percentage of total goods imports represented by ICT goods imports.\n\n24. ICT service exports (% of service exports, BoP): The percentage of service exports represented by ICT service exports in balance of payments (BoP).\n\n25. ICT service exports (BoP, current US$): The value of ICT service exports in balance of payments (BoP) current US dollars.\n\n26. Import value index (2000 = 100): The import value index with a base year of 2000.\n\n27. Import volume index (2000 = 100): The import volume index with a base year of 2000.\n\n28. Imports of goods and services (annual % growth): The annual percentage growth of imports of goods and services.\n\n29. Imports of goods and services (constant 2015 US$): The value of imports of goods and services in constant 2015 US dollars.\n\n30. Insurance and financial services (% of commercial service exports): The percentage of commercial service exports represented by insurance and financial services.\n\n31. Insurance and financial services (% of commercial service imports): The percentage of commercial service imports represented by insurance and financial services.\n\n32. Insurance and financial services (% of service exports, BoP): The percentage of service exports represented by insurance and financial services in balance of payments (BoP).\n\n33. International tourism, expenditures (% of total imports): The percentage of total imports represented by international tourism expenditures.\n\n34. International tourism, expenditures for passenger transport items (current US$): The expenditures for passenger transport items in current US dollars.\n\n35. Lead time to export, median case (days): The median number of days required for export.\n\n36. Logistics performance index: Competence and quality of logistics services (1=low to 5=high): A measure of the competence and quality of logistics services on a scale from 1 to 5.\n\n37. Logistics performance index: Ease of arranging competitively priced shipments (1=low to 5=high): A measure of the ease of arranging competitively priced shipments on a scale from 1 to 5.\n\n38. Logistics performance index: Efficiency of customs clearance process (1=low to 5=high): A measure of the efficiency of the customs clearance process on a scale from 1 to 5.\n\n39. Logistics performance index: Quality of trade and transport-related infrastructure (1=low to 5=high): A measure of the quality of trade and transport-related infrastructure on a scale from 1 to 5.\n\n40. Manufactures exports (% of merchandise exports): The percentage of merchandise exports represented by manufactured goods exports.\n\n41. Manufactures imports (% of merchandise imports): The percentage of merchandise imports represented by manufactured goods imports.\n\n42. Merchandise exports to economies in the Arab World (% of total merchandise exports): The percentage of total merchandise exports represented by exports to economies in the Arab World.\n\n43. Merchandise exports to high-income economies (% of total merchandise exports): The percentage of total merchandise exports represented by exports to high-income economies.\n\n44. Merchandise exports to low- and middle-income economies in East Asia & Pacific (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies in East Asia & Pacific.\n\n45. Merchandise exports to low- and middle-income economies in Europe & Central Asia (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies in Europe & Central Asia.\n\n46. Merchandise exports to low- and middle-income economies in South Asia (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies in South Asia.\n\n47. Merchandise exports to low- and middle-income economies in Sub-Saharan Africa (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies in Sub-Saharan Africa.\n\n48. Merchandise exports to low- and middle-income economies outside region (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies outside the region.\n\n49. Merchandise exports to low- and middle-income economies within region (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies within the region.\n\n50. Merchandise imports (current US$): The value of merchandise imports in current US dollars.\n\n51. Merchandise imports from high-income economies (% of total merchandise imports): The percentage of total merchandise imports represented by imports from high-income economies.\n\n52. Merchandise imports from low- and middle-income economies in Latin America & Caribbean (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies in Latin America & Caribbean.\n\n53. Merchandise imports from low- and middle-income economies in Middle East & North Africa (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies in Middle East & North Africa.\n\n54. Merchandise imports from low- and middle-income economies in South Asia (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies in South Asia.\n\n55. Merchandise imports from low- and middle-income economies in Sub-Saharan Africa (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies in Sub-Saharan Africa.\n\n56. Merchandise imports from low- and middle-income economies within region (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies within the region.\n\n57. Net trade in goods (BoP, current US$): The net trade value of goods in balance of payments (BoP) current US dollars.\n\n58. Ores and metals exports (% of merchandise exports): The percentage of merchandise exports represented by exports of ores and metals.\n\n59. Ores and metals imports (% of merchandise imports): The percentage of merchandise imports represented by imports of ores and metals.\n\n60. Service imports (BoP, current US$): The value of service imports in balance of payments (BoP) current US dollars.\n\n61. Share of tariff lines with international peaks, all products (%): The percentage of tariff lines with international peaks for all products.\n\n62. Share of tariff lines with international peaks, primary products (%): The percentage of tariff lines with international peaks for primary products.\n\n63. Share of tariff lines with specific rates, manufactured products (%): The percentage of tariff lines with specific rates for manufactured products.\n\n64. Tariff rate, applied, simple mean, manufactured products (%): The simple mean applied tariff rate for manufactured products.\n\n65. Tariff rate, applied, simple mean, primary products (%): The simple mean applied tariff rate for primary products.\n\n66. Tariff rate, applied, weighted mean, manufactured products (%): The weighted mean applied tariff rate for manufactured products.\n\n67. Tariff rate, applied, weighted mean, primary products (%): The weighted mean applied tariff rate for primary products.\n\n68. Tariff rate, most favored nation, simple mean, all products (%): The simple mean most favored nation tariff rate for all products.\n\n69. Tariff rate, most favored nation, weighted mean, all products (%): The weighted mean most favored nation tariff rate for all products.\n\n70. Time to export, border compliance (hours): The time required for exporting goods related to border compliance, measured in hours.\n\n71. Time to export, documentary compliance (hours): The time required for exporting goods related to documentary compliance, measured in hours.\n\n72. Time to import, border compliance (hours): The time required for importing goods related to border compliance, measured in hours.\n\n73. Time to import, documentary compliance (hours): The time required for importing goods related to documentary compliance, measured in hours.\n\n74. Trade in services (% of GDP): The percentage of GDP represented by trade in services.\n\n75. Transport services (% of commercial service imports): The percentage of commercial service imports represented by transport services.\n\n76. Transport services (% of service exports, BoP): The percentage of service exports in balance of payments (BoP) represented by transport services.\n\n77. Travel services (% of service imports, BoP): The percentage of service imports in balance of payments (BoP) represented by travel services.\n\n78. Agricultural raw materials exports (% of merchandise exports): The percentage of merchandise exports represented by agricultural raw materials exports.\n\n79. Average time to clear exports through customs (days): The average number of days required to clear exports through customs.\n\n80. Binding coverage, manufactured products (%): The percentage of manufactured products with binding coverage.\n\n81. Bound rate, simple mean, primary products (%): The simple mean bound rate for primary products.\n\n82. Commercial service exports (current US$): The value of commercial service exports in current US dollars.\n\n83. Communications, computer, etc. (% of service exports, BoP): The percentage of service exports in balance of payments (BoP) represented by communications, computer, and other services.\n\n84. Computer, communications and other services (% of commercial service imports): The percentage of commercial service imports represented by computer, communications, and other services.\n\n85. Cost to export, documentary compliance (US$): The cost in US dollars for exporting goods, related to documentary compliance.\n\n86. Cost to import, border compliance (US$): The cost in US dollars for importing goods, related to border compliance.\n\n87. Cost to import, documentary compliance (US$): The cost in US dollars for importing goods, related to documentary compliance.\n\n88. Energy imports, net (% of energy use): The percentage of net energy imports out of total energy use.\n\n89. Export unit value index (2015 = 100): The export unit value index with a base year of 2015.\n\n90. Export value index (2000 = 100): The export value index with a base year of 2000.\n\n91. Export volume index (2000 = 100): The export volume index with a base year of 2000.\n\n92. Exports as a capacity to import (constant LCU): The capacity of exports to import in constant local currency units.\n\n93. Exports of goods and services (% of GDP): The percentage of GDP represented by exports of goods and services.\n\n94. Exports of goods and services (annual % growth): The annual percentage growth of exports of goods and services.\n\n95. Exports of goods and services (BoP, current US$): The value of goods and services exported in balance of payments (BoP) current US dollars.\n\n96. Exports of goods and services (constant 2015 US$): The value of goods and services exported in constant 2015 US dollars.\n\n97. External balance on goods and services (current US$): The external balance on goods and services in current US dollars.\n\n98. Fuel exports (% of merchandise exports): The percentage of merchandise exports represented by fuel exports.\n\n99. Fuel imports (% of merchandise imports): The percentage of merchandise imports represented by fuel imports.\n\n100. High-technology exports (% of manufactured exports): The percentage of manufactured exports represented by high-technology exports.\n\n101. High-technology exports (current US$): The value of high-technology exports in current US dollars.\n\n102. Import unit value index (2015 = 100): The import unit value index with a base year of 2015.\n\n103. Imports of goods and services (% of GDP): The percentage of GDP represented by imports of goods and services.\n\n104. Imports of goods and services (BoP, current US$): The value of goods and services imported in balance of payments (BoP) current US dollars.\n\n105. Imports of goods and services (current US$): The value of goods and services imported in current US dollars.\n\n106. Imports of goods, services and primary income (BoP, current US$): The value of goods, services, and primary income imported in balance of payments (BoP) current US dollars.\n\n107. Insurance and financial services (% of service imports, BoP): The percentage of service imports in balance of payments (BoP) represented by insurance and financial services.\n\n108. International tourism, expenditures (current US$): The expenditures on international tourism in current US dollars.\n\n109. International tourism, expenditures for travel items (current US$): The expenditures on international tourism for travel items in current US dollars.\n\n110. International tourism, number of arrivals: The number of international tourism arrivals.\n\n111. International tourism, number of departures: The number of international tourism departures.\n\n112. International tourism, receipts (% of total exports): The percentage of total exports represented by international tourism receipts.\n\n113. International tourism, receipts (current US$): The receipts from international tourism in current US dollars.\n\n114. International tourism, receipts for passenger transport items (current US$): The receipts from international tourism for passenger transport items in current US dollars.\n\n115. International tourism, receipts for travel items (current US$): The receipts from international tourism for travel items in current US dollars.\n\n116. Lead time to import, median case (days): The median number of days required for import.\n\n117. Logistics performance index: Ability to track and trace consignments (1=low to 5=high): A measure of the ability to track and trace consignments on a scale from 1 to 5.\n\n118. Logistics performance index: Frequency with which shipments reach consignee within scheduled or expected time (1=low to 5=high): A measure of the frequency with which shipments reach the consignee within the scheduled or expected time on a scale from 1 to 5.\n\n119. Logistics performance index: Overall (1=low to 5=high): The overall logistics performance index on a scale from 1 to 5.\n\n120. Medium and high-tech exports (% manufactured exports): The percentage of manufactured exports represented by medium and high-tech exports.\n\n121. Merchandise exports (current US$): The value of merchandise exports in current US dollars.\n\n122. Merchandise exports by the reporting economy (current US$): The value of merchandise exports by the reporting economy in current US dollars.\n\n123. Merchandise exports by the reporting economy, residual (% of total merchandise exports): The percentage of total merchandise exports represented by merchandise exports from the reporting economy.\n\n124. Merchandise exports to low- and middle-income economies in Latin America & Caribbean (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies in Latin America & Caribbean.\n\n125. Merchandise exports to low- and middle-income economies in Middle East & North Africa (% of total merchandise exports): The percentage of total merchandise exports represented by exports to low- and middle-income economies in Middle East & North Africa.\n\n126. Merchandise imports by the reporting economy (current US$): The value of merchandise imports by the reporting economy in current US dollars.\n\n127. Merchandise imports by the reporting economy, residual (% of total merchandise imports): The percentage of total merchandise imports represented by merchandise imports by the reporting economy.\n\n128. Merchandise imports from economies in the Arab World (% of total merchandise imports): The percentage of total merchandise imports represented by imports from economies in the Arab World.\n\n129. Merchandise imports from low- and middle-income economies in East Asia & Pacific (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies in East Asia & Pacific.\n\n130. Merchandise imports from low- and middle-income economies in Europe & Central Asia (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies in Europe & Central Asia.\n\n131. Merchandise imports from low- and middle-income economies outside region (% of total merchandise imports): The percentage of total merchandise imports represented by imports from low- and middle-income economies outside the region.\n\n132. Merchandise trade (% of GDP): The percentage of GDP represented by merchandise trade.\n\n133. Net barter terms of trade index (2000 = 100): The net barter terms of trade index with a base year of 2000.\n\n134. Net trade in goods and services (BoP, current US$): The net trade value of goods and services in balance of payments (BoP) current US dollars.\n\n135. Service exports (BoP, current US$): The value of service exports in balance of payments (BoP) current US dollars.\n\n136. Share of tariff lines with international peaks, manufactured products (%): The percentage of tariff lines with international peaks for manufactured products.\n\n137. Share of tariff lines with specific rates, all products (%): The percentage of tariff lines with specific rates for all products.\n\n138. Share of tariff lines with specific rates, primary products (%): The percentage of tariff lines with specific rates for primary products.\n\n139. Tariff rate, applied, simple mean, all products (%): The simple mean applied tariff rate for all products.\n\n140. Tariff rate, applied, weighted mean, all products (%): The weighted mean applied tariff rate for all products.\n\n141. Tariff rate, most favored nation, simple mean, manufactured products (%): The simple mean most favored nation tariff rate for manufactured products.\n\n142. Tariff rate, most favored nation, simple mean, primary products (%): The simple mean most favored nation tariff rate for primary products.\n\n143. Tariff rate, most favored nation, weighted mean, manufactured products (%): The weighted mean most favored nation tariff rate for manufactured products.\n\n144. Tariff rate, most favored nation, weighted mean, primary products (%): The weighted mean most favored nation tariff rate for primary products.\n\n145. Taxes on exports (% of tax revenue): The percentage of tax revenue related to taxes on exports.\n\n146. Trade (% of GDP): The percentage of GDP represented by total trade.\n\n147. Transport services (% of commercial service exports): The percentage of commercial service exports represented by transport services.\n\n148. Transport services (% of service imports, BoP): The percentage of service imports in balance of payments (BoP) represented by transport services.\n\n149. Travel services (% of commercial service exports): The percentage of commercial service exports represented by travel services.\n\n150. Travel services (% of commercial service imports): The percentage of commercial service imports represented by travel services.\n\n151. Travel services (% of service exports, BoP): The percentage of service exports in balance of payments (BoP) represented by travel services.\n\nThe dataset contains a wide range of trade-related data attributes, including the percentage indicators, economic values, and various indices."
    },
    "Urban Development.csv": {
        "name": "Urban Development.csv",
        "description": "The dataset is named \"Urban Development.csv\" and it consists of various attributes related to urban development. \n\nThe data attributes and their descriptions are as follows:\n\n- country_name: The name of the country.\n- date: The date of the observation.\n- Access to electricity, urban (% of urban population): The percentage of the urban population with access to electricity.\n- Mortality caused by road traffic injury (per 100,000 population): The number of deaths caused by road traffic injuries per 100,000 population.\n- PM2.5 air pollution, mean annual exposure (micrograms per cubic meter): The average annual exposure to PM2.5 air pollution in micrograms per cubic meter.\n- PM2.5 air pollution, population exposed to levels exceeding WHO guideline value (% of total): The percentage of the population exposed to PM2.5 air pollution levels that exceed the guideline value set by the World Health Organization.\n- Population density (people per sq. km of land area): The number of people per square kilometer of land area.\n- Population in largest city: The population of the largest city in the country.\n- Population in the largest city (% of urban population): The percentage of the urban population residing in the largest city.\n- Population in urban agglomerations of more than 1 million: The population living in urban agglomerations (areas with contiguous urban development) with more than 1 million inhabitants.\n- Population in urban agglomerations of more than 1 million (% of total population): The percentage of the total population living in urban agglomerations with more than 1 million inhabitants.\n- Population living in slums (% of urban population): The percentage of the urban population living in slums.\n- Pump price for diesel fuel (US$ per liter): The price of diesel fuel in US dollars per liter.\n- Pump price for gasoline (US$ per liter): The price of gasoline in US dollars per liter.\n- Urban land area (sq. km): The total area of urban land in square kilometers.\n- Urban land area where elevation is below 5 meters (% of total land area): The percentage of total land area where the elevation is below 5 meters in urban areas.\n- Urban land area where elevation is below 5 meters (sq. km): The area of land in urban areas where the elevation is below 5 meters in square kilometers.\n- Urban population: The total population living in urban areas.\n- Urban population (% of total population): The percentage of the total population living in urban areas.\n- Urban population growth (annual %): The annual percentage change in the urban population.\n- Urban population living in areas where elevation is below 5 meters (% of total population): The percentage of the total population living in urban areas where the elevation is below 5 meters."
    }
}